[
{
    "url": "https://elevenlabs.io/docs/overview",
    "text": "Most popular\nMeet the models\nCapabilities\nProduct guides\nElevenLabs\nElevenLabs is an AI audio research and deployment company.\nLearn how to integrate ElevenLabs\nDeploy voice agents in minutes\nLearn how to use ElevenLabs\nDive into our API reference\nOur most lifelike, emotionally rich speech synthesis model\nOur fast, affordable speech synthesis model\nConvert text into lifelike speech\nModify and transform voices\nIsolate voices from background noise\nDub audio and videos seamlessly\nCreate cinematic sound effects\nClone and design custom voices\nDeploy intelligent voice agents\nExplore our product guides for step-by-step guidance"
}
,
{
    "url": "https://buildwithfern.com/?utm_campaign=buildWith&utm_medium=docs&utm_source=elevenlabs.io",
    "text": "Instant Docs and SDKs for your API\nElevate your developer experience\nSDKs that are designed by language experts\nJust run \nImport your API spec\nSelect languages to generate\nAdd custom code\nPublish packages\nEvery feature you need, built-in\nAutomatic updates via CI/CD\nOAuth 2.0\nServer sent events\nAuto pagination\nPolymorphism (Unions)\nAudiences\nMultipart form uploads\nRetries with exponential backoff\nIdempotency headers\nCode Snippets over API\nDependency vulnerability scanning\nEverything you need to impress your users\nDocs as code\nSEO optimized\nPreview deployments\nAPI key injection\nAccess control (RBAC)\nFederated authentication\nVersioning\nWebSockets\nComponent library\nCustomize with JavaScript and CSS\nBring your own React component\nAI chat\n/llms.txt\nYour SDK team.\nYour Docs team.\nPublish client libraries in popular languages.\nAPI documentation tailored to your brand.\nStart with OpenAPI. \n SDKs in multiple languages and interactive API documentation tailored to your brand.\nStart with Docs, SDKs, or both — it’s your choice.\nEvery generated SDK respects the idioms of the language, contains strong types, inlined docs, and intuitive error handling.\nCheck out live SDKs built with Fern\nCheck out live SDKs built with Fern\nWe evaluated several SDK generators and Fern stood out for its clean, language-native, and thoughtfully architected code. \n‍\nJohn Fellman\nHead of Engineering, Developer Platform\nFern generates and publishes client libraries, so you can focus on building the API.\nStart with OpenAPI, AsyncAPI, gRPC or our simpler format, the Fern Definition.\nWe support TypeScript, Python, Go, Java, Ruby, C# & PHP. \nSwift & Rust coming soon.\nExtend the generated client with utility functions and custom logic. \nYour changes won’t be overwritten on re-generation.\nFern semantically versions and publishes packages to each registry (e.g. npm, pypi, maven)\nFern SDKs support OAuth 2.0, server-sent events, auto-pagination and more.\nUse the Fern CLI to generate SDKs as part of your release process.\nHandle OAuth 2.0 authentication seamlessly with automatic token management and refresh.\nStream real-time updates effortlessly with built-in SSE support.\nAutomatically iterate through paginated data with built-in pagination helpers.\nHandle complex polymorphic data with native type safety in every language.\nFilter your API definition to the endpoints and properties you want included in your SDK.\nSeamlessly handle multipart uploads with built-in utilities for streaming binary data and MIME types.\nAutomatically retry failed requests and maximize the uptime of your API.\nSend idempotency headers to ensure safe retries for sensitive operations (e.g. sending payments).\nFetch SDK code samples from our API and embed them in your application.\nFern adheres to an SLA to detect and remediate vulnerable dependencies.\nStunning by default, easy to update, and designed to convert.\nUse git to version and release changes to your documentation.\nFern uses industry best practices to make your website fast and SEO optimized to rank.\nPreview changes to your documentation with a unique URL for each pull request.\nAutomatically populate API keys so that users can instantly make API calls and see realistic responses.\nAssign role-based permissions and configure what content a user can access.\nSecure your documentation behind auth. Fern supports SSO, OAuth, and username + password.\nDocument and manage multiple versions of your product or API to support users across different releases.\nDocument your WebSocket send and receive events with an AsyncAPI spec. \nInteract with the WebSocket via an API Explorer that lets you establish live connections.\nLeverage prebuilt components like cards, accordions, tabs, and code blocks.\nCustomize your docs with JavaScript and CSS to match your brand identity and extend functionality.\nBuild custom React components and embed them in your docs.\nInteract with an AI assistant trained on your docs to quickly find answers and troubleshoot issues.\nServe an llms.txt with no extra effort, allowing agents to understand the capabilities of your product.\nWe partner with you to perfect your OpenAPI spec and launch SDKs that scale to millions of downloads.\nPowering SDKs for world-class companies\nOur team creates a custom theme, migrates all your content, and launches your site.\nProviding gorgeous Docs for world-class companies\nBuilt with\nFern automated SDK maintenance, allowing us to support all popular programming languages without needing dedicated engineering resources. \n-- they bring expert-level guidance in OpenAPI and SDK design.\nLiz Moy\nSenior Developer Relations Engineer\nPartnering with Fern, \n Fern also generates our documentation website that perfectly matches Cohere's unique brand identity.\nBilly Trend\nDeveloper Relations Engineer\nWe used an alternative SDK generator, OpenAPI Generator, for years, and customers constantly complained. \nGil Feig\nCTO\nThey embedded with our docs team, migrated over 700+ pages of content, and created an intuitive information architecture across API reference, guides and SDK reference.\nMatt Makai\nVP of Developer Experience\nCompared to OpenAPI, it's more ergonomic and comes with powerful capabilities - you can organize endpoints by resource, import types across files, and represent complex APIs like server sent events and websockets.\nKabir Goel\nFounding Engineer\nKeeping our docs, SDKs, and server implementation in sync was a nightmare. Fern enabled us to adopt API-first development — our engineers update the spec, run fern generate, and everything stays perfectly aligned.\nSteve Yazicioglu\nHead of Engineering\nFern has been \n. We often get compliments in sales calls and during new pilot onboardings about the quality of our docs.\nMichael Bauer\nSoftware Engineer at Nominal\nDelight your developers with SDKs and Docs."
}
,
{
    "url": "https://elevenlabs.io/docs/resources/zero-retention-mode",
    "text": "Background\nWhat is zero retention mode?\nWho has access to zero retention mode?\nWhen can a customer use zero retention mode?\nHow does zero retention mode work?\nWhat products are configured for zero retention mode?\nWhat are some limitations of zero retention mode?\nHow retention works if zero retention mode is not active?\nData backup (When zero retention mode is not used)\nAccount deletion (When zero retention mode is not used)\nZero retention mode (Enterprise)\nLearn how to use Zero Retention Mode to protect sensitive data.\nBy default, we retain data, in accordance with our Privacy Policy, to enhance our services, troubleshoot issues, and ensure the security of our systems. However, for some enterprise customers, we offer a “Zero Retention Mode” option for specific products. In this Zero Retention Mode, most data in requests and responses are immediately deleted once the request is completed.\nZero Retention Mode provides an additional level of security and peace of mind for especially sensitive workflows. When enabled, logging of certain data points is restricted, including:\nThis data is related to the processing of the request, and can only be seen by the user doing the request and the volatile memory of the process serving the request. None of this data is sent at any point to a database where data is stored long term.\nEnterprise customers can use zero Retention Mode.\nIt is primarily intended for use by our customers in the healthcare and banking sector, and other customers who may use our services to process sensitive information.\nZero Retention Mode is available to select enterprise customers. However, access to this feature may be restricted if ElevenLabs determines a customer’s use case to be high risk, if an account is flagged by an automated system for additional moderation or at ElevenLabs’ sole discretion. In such cases, the enterprise administrator will be promptly notified of the restriction.\nZero Retention Mode only works for API requests, specifically:\nAfter setup, check the request history to verify zero Retention Mode is enabled. If enabled, there should be no requests in the history.\nZero retention mode can be used by sending \n with the product which supports it.\nFor example, in Text to Speech API, you can set the query parameter \n to False like this:\nTroubleshooting and support for zero Retention Mode is limited. Because of the configuration, we will not be able to diagnose issues with TTS/STS generations. Debugging will be more difficult as a result.\nCustomers by default have history preservation enabled. All customers can use the API to delete generations at any time. This action will immediately remove the corresponding audio and text from our database; however, debugging and moderation logs may still retain data related to the generation.\nFor any retained data, we regularly back up such data to prevent data loss in the event of any unexpected incidents. Following data deletion, database items are retained in backups for up to 30 days After this period, the data expires and is not recoverable.\nAll data is deleted from our systems permanently when you delete your account. This includes all data associated with your account, such as API keys, request history, and any other data stored in your account. We also take commercially reasonable efforts to delete debugging data related to your account."
}
,
{
    "url": "https://elevenlabs.io/docs/resources/troubleshooting",
    "text": "General\nStudio (formerly Projects)\nTroubleshooting\nExplore common issues and solutions.\nOur models are non-deterministic, meaning outputs can vary based on inputs. While we strive to enhance predictability, some variability is inherent. This guide outlines common issues and preventive measures.\nIf the generated voice output varies in volume or tone, it is often due to inconsistencies in the voice clone training audio.\nTo minimize issues, consider breaking your text into smaller segments. This approach helps maintain consistent volume and reduces degradation over longer audio generations. Utilize our Studio feature to generate several smaller audio segments simultaneously, ensuring better quality and consistency.\nRefer to our guides for optimizing Instant and Professional Voice Clones for best practices and\nadvice.\nThe multilingual models may rarely mispronounce certain words, even in English. This issue appears to be somewhat arbitrary but seems to be voice and text-dependent. It occurs more frequently with certain voices and text, especially when using words that also appear in other languages.\nThe AI can sometimes switch languages or accents throughout a single generation, especially if that generation is longer in length. This issue is similar to the mispronunciation problem and is something we are actively working to improve.\nThe models may mispronounce certain numbers, symbols and acronyms. For example, the numbers “1, 2, 3” might be pronounced as “one,” “two,” “three” in English. To ensure correct pronunciation in another language, write them out phonetically or in words as you want them to be spoken.\nCorrupt speech is a rare issue where the model generates muffled or distorted audio. This occurs\nunpredictably, and we have not identified a cause. If encountered, regenerate the section to\nresolve the issue.\nAudio quality may degrade during extended text-to-speech conversions, especially with the Multilingual v1 model. To mitigate this, break text into sections under 800 characters.\nFor some voices, this voice setting can lead to instability, including inconsistent speed,\nmispronunciation and the addition of extra sounds. We recommend keeping this setting at 0,\nespecially if you find you are experiencing these issues in your generated audio.\nThe import function attempts to import the file you provide to the website. Given the variability in website structures and book formatting, including images, always verify the import for accuracy.\nOccasionally, glitches or sharp breaths may occur between paragraphs. This is rare and differs\nfrom standard Text to Speech issues. If encountered, regenerate the preceding paragraph, as the\nproblem often originates there.\nIf an issue persists after following this troubleshooting guide, please \n."
}
,
{
    "url": "https://elevenlabs.io/docs/capabilities/voices",
    "text": "Overview\nVoice categories\nManaging voices\nSupported languages\nFAQ\nVoices\nLearn how to create, customize, and manage voices with ElevenLabs.\nElevenLabs provides models for voice creation & customization. The platform supports a wide range of voice options, including voices from our extensive \n, voice cloning, and artificially designed voices using text prompts.\nThe \n contains over 5,000 voices shared by the ElevenLabs community. Use it to:\nShare your voice with the community, set your terms, and earn cash rewards when others use it.\nWe’ve paid out over \n already.\nLearn how to use voices from the voice library\nClone your own voice from 30-second samples with Instant Voice Cloning, or create hyper-realistic voices using Professional Voice Cloning.\nVoice-captcha technology is used to verify that \n voice clones are created from your own voice samples.\nLearn how to create instant & professional voice clones\nWith \n, you can create entirely new voices by specifying attributes like age, gender, accent, and tone. Generated voices are ideal for:\nThe voice design tool creates 3 voice previews, simply provide:\nIntegrate voice design into your application.\nLearn how to craft voices from a single prompt.\nOur curated set of default voices is optimized for core use cases. These voices are:\nDefault voices are available to all users via the \n tab in the \n. Default voices were previously referred to as\n\n voices. The latter term is still used when accessing default voices via the API.\nAll voices can be managed through \n, where you can:\nLearn how to manage your voice collection in \n.\n: Try searching by specific accents or genres, such as “Australian narration” or “child-like character.”\nAll ElevenLabs voices support multiple languages. Experiment by converting phrases like \n into speech to hear how your own voice sounds across different languages.\nElevenLabs supports voice creation in 32 languages. Match your voice selection to your target region for the most natural results.\nOur v2 models support 29 languages:\nFlash v2.5 supports 32 languages - all languages from v2 models plus:\nYes, you can create custom voices with Voice Design or clone voices using Instant or\nProfessional Voice Cloning. Both options are accessible in \n.\nInstant Voice Cloning uses short audio samples for near-instantaneous voice creation.\nProfessional Voice Cloning requires longer samples but delivers hyper-realistic, high-quality\nresults.\nProfessional Voice Clones can be shared privately or publicly in the Voice Library. Generated\nvoices and Instant Voice Clones cannot currently be shared.\nUse \n to search, filter, and organize your voice collection. You can also delete,\ntag, and categorize voices for easier management.\nUse clean and consistent audio samples. For Professional Voice Cloning, provide a variety of\nrecordings in the desired speaking style.\nYes, Professional Voice Clones can be shared in the Voice Library. Instant Voice Clones and\nGenerated Voices cannot currently be shared.\nGenerated Voices are ideal for unique characters in games, animations, and creative\nstorytelling.\nGo to \n in your dashboard or access it via API."
}
,
{
    "url": "https://elevenlabs.io/docs/best-practices/latency-optimization",
    "text": "Use Flash models\nLeverage streaming\nStreaming\nWebsockets\nConsider geographic proximity\nChoose appropriate voices\nLatency optimization\nLearn how to optimize text-to-speech latency.\nThis guide covers the core principles for improving text-to-speech latency.\nWhile there are many individual techniques, we’ll group them into \n.\nEnterprise customers benefit from increased concurrency limits and priority access to our rendering queue. \n to learn more about our enterprise\nplans.\n deliver ~75ms inference speeds, making them ideal for real-time applications. The trade-off is a slight reduction in audio quality compared to \n.\n75ms refers to model inference time only. Actual end-to-end latency will vary with factors such as\nyour location & endpoint type used.\nThere are three types of text-to-speech endpoints available in our \n:\nStreaming endpoints progressively return audio as it is being generated in real-time, reducing the time-to-first-byte. This endpoint is recommended for cases where the input text is available up-front.\nStreaming is supported for the \n API, \n API & \n API.\nThe \n supports bidirectional streaming making it perfect for applications with real-time text input (e.g. LLM outputs).\nSetting \n to true automatically handles generation triggers, removing the need to\nmanually manage chunk strategies.\nIf \n is disabled, the model will wait for enough text to match the chunk schedule before starting to generate audio.\nFor instance, if you set a chunk schedule of 125 characters but only 50 arrive, the model stalls until additional characters come in—potentially increasing latency.\nFor implementation details, see the \n.\nBecause our models are served in the US, your geographic location will affect the network latency you experience.\nFor example, using Flash models with Websockets, you can expect the following TTFB latencies:\nWe are actively working on deploying our models in EU and Asia. These deployments will bring\nspeeds closer to those experienced by US customers.\nWe have observed that in some cases, voice selection can impact latency. Here’s the order from fastest to slowest:\nHigher audio quality output formats can increase latency. Be sure to balance your latency requirements with audio fidelity needs."
}
,
{
    "url": "https://buildwithfern.com/terms-of-service",
    "text": "Terms of Service\nInformation We Collect\nLog Data\nDevice Data\nPersonal Information\nLegitimate Reasons for Processing Your Personal Information\nCollection and Use of Information\nSecurity of Your Personal Information\nHow Long We Keep Your Personal Information\nChildren’s Privacy\nInternational Transfers of Personal Information\nYour Rights and Controlling Your Personal Information\nLimits of Our Policy\nBranding and Fair Use\nContact Us\nTable of contents\nPublish client libraries in popular languages.\nAPI documentation tailored to your brand.\nWelcome to the Birch Solutions, Inc. dba Fern (“\n”, “\n” “\n” or “\n”) website. Please read these Terms of Service (the “\n”) carefully because they govern your use of our websites including buildwithfern.com and within our \n.\nThis Agreement is between Fern and the company or person accessing or using the Product. This Agreement consists of: (1) the Order Form and (2) the Key Terms, both of which are on the Cover Page below, and (3) the Common Paper \n (“Standard Terms”). Any modifications to the Standard Terms made in the Cover Page will control over conflicts with the Standard Terms. Capitalized words have the meanings or descriptions given in the Cover Page or the Standard Terms.\nIf you are accessing or using the Product on behalf of your company, you represent that you are authorized to accept this Agreement on behalf of your company. By signing up, accessing, or using the Product, Customer indicates its acceptance of this Agreement and agrees to be bound by the terms and conditions of this Agreement.\nCover Page\n Fern offers cloud-based software to define APIs and generate code, including SDKs and documentation.\n The Effective Date\n 12 month(s)\n At least 30 days before the end of the current Subscription Period.\nSection 5.2 of the Standard Terms is replaced with: Certain parts of the Product have different pricing plans, which are available at Provider’s pricing page (\n). Within the Payment Period, Customer will pay Provider fees based on the Product tier selected at the time of account creation and Customer’s usage per Subscription Period. Provider may update Product pricing by giving at least 30 days notice to Customer (including by email or notification within the Product), and the change will apply in the next Subscription Period.\n 30 day(s) from Customer's receipt of invoice\n  Annually\n The company or person who accesses or uses the Product. If the person accepting this Agreement is doing so on behalf of a company, all use of the word \"Customer\" in the Agreement will mean that company.\n Birch Solutions, Inc. dba Fern\n The date Customer first accepts this Agreement.\n Any action, proceeding, or claim that the Cloud Service, when used by Customer according to the terms of the Agreement, violates, misappropriates, or otherwise infringes upon anyone else’s intellectual property or other proprietary rights.\n Any action, proceeding, or claim that (1) the Customer Content, when used according to the terms of the Agreement, violates, misappropriates, or otherwise infringes upon anyone else’s intellectual property or other proprietary rights; or (2) results from Customer’s breach or alleged breach of Section 2.1 (Restrictions on Customer).\nThe fees paid or payable by Customer to provider in the 12 month period immediately before the claim\n  The laws of the State of Delaware\n The state or federal courts located in Delaware\nFor Provider: \nFor Customer: The main email address on Customer's account\n Modifying Section 14.7 of the Standard Terms, Provider may identify Customer and use Customer’s logo and trademarks on Provider’s website and in marketing materials to identify Customer as a user of the Product. Customer hereby grants Provider a non-exclusive, royalty-free license to do so in connection with any marketing, promotion, or advertising of Provider or the Product during the length of the Agreement.\nInformation we collect includes both information you knowingly and actively provide us when using or participating in any of our services and promotions, and any information automatically sent by your devices in the course of accessing our products and services.\nWhen you visit our website, our servers may automatically log the standard data provided by your web browser. It may include your device’s Internet Protocol (IP) address, your browser type and version, the pages you visit, the time and date of your visit, the time spent on each page, and other details about your visit.\nAdditionally, if you encounter certain errors while using the site, we may automatically collect data about the error and the circumstances surrounding its occurrence. This data may include technical details about your device, what you were trying to do when the error happened, and other technical information relating to the problem. You may or may not receive notice of such errors, even in the moment they occur, that they have occurred, or what the nature of the error is.\nPlease be aware that while this information may not be personally identifying by itself, it may be possible to combine it with other data to personally identify individual persons.\nWhen you visit our website or interact with our services, we may automatically collect data about your device, such as:\nData we collect can depend on the individual settings of your device and software. We recommend checking the policies of your device manufacturer or software provider to learn what information they make available to us.\nWe may ask for personal information which may include one or more of the following:\nWe only collect and use your personal information when we have a legitimate reason for doing so. In which instance, we only collect personal information that is reasonably necessary to provide our services to you.\nWe may collect personal information from you when you do any of the following on our website:\nWe may collect, hold, use, and disclose information for the following purposes, and personal information will not be further processed in a manner that is incompatible with these purposes:\nPlease be aware that we may combine information we collect about you with general information or research data we receive from other trusted sources.\nWhen we collect and process personal information, and while we retain this information, we will protect it within commercially acceptable means to prevent loss and theft, as well as unauthorized access, disclosure, copying, use, or modification.\nAlthough we will do our best to protect the personal information you provide to us, we advise that no method of electronic transmission or storage is 100% secure, and no one can guarantee absolute data security. We will comply with laws applicable to us in respect of any data breach.\nYou are responsible for selecting any password and its overall security strength, ensuring the security of your own information within the bounds of our services.\nWe keep your personal information only for as long as we need to. This time period may depend on what we are using your information for, in accordance with this privacy policy. If your personal information is no longer required, we will delete it or make it anonymous by removing all details that identify you.\nHowever, if necessary, we may retain your personal information for our compliance with a legal, accounting, or reporting obligation or for archiving purposes in the public interest, scientific, or historical research purposes or statistical purposes.\nWe do not aim any of our products or services directly at children under the age of 13, and we do not knowingly collect personal information about children under 13.\nDisclosure of Personal Information to Third Parties We may disclose personal information to:\nThe personal information we collect is stored and/or processed in United States, or where we or our partners, affiliates, and third-party providers maintain facilities.\nThe countries to which we store, process, or transfer your personal information may not have the same data protection laws as the country in which you initially provided the information. If we transfer your personal information to third parties in other countries: (i) we will perform those transfers in accordance with the requirements of applicable law; and (ii) we will protect the transferred personal information in accordance with this privacy policy.\nYou always retain the right to withhold personal information from us, with the understanding that your experience of our website may be affected. We will not discriminate against you for exercising any of your rights over your personal information. If you do provide us with personal information you understand that we will collect, hold, use and disclose it in accordance with this privacy policy. You retain the right to request details of any personal information we hold about you.\nIf we receive personal information about you from a third party, we will protect it as set out in this privacy policy. If you are a third party providing personal information about somebody else, you represent and warrant that you have such person’s consent to provide the personal information to us.\nIf you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time. We will provide you with the ability to unsubscribe from our email-database or opt out of communications. Please be aware we may need to request specific information from you to help us confirm your identity.\nIf you believe that any information we hold about you is inaccurate, out of date, incomplete, irrelevant, or misleading, please contact us using the details provided in this privacy policy. We will take reasonable steps to correct any information found to be inaccurate, incomplete, misleading, or out of date.\nIf you believe that we have breached a relevant data protection law and wish to make a complaint, please contact us using the details below and provide us with full details of the alleged breach. We will promptly investigate your complaint and respond to you, in writing, setting out the outcome of our investigation and the steps we will take to deal with your complaint. You also have the right to contact a regulatory body or data protection authority in relation to your complaint.\nAt our discretion, we may change our privacy policy to reflect updates to our business processes, current acceptable practices, or legislative or regulatory changes. If we decide to change this privacy policy, we will post the changes here at the same link by which you are accessing this privacy policy.\nIf the changes are significant, or if required by applicable law, we will contact you (based on your selected preferences for communications from us) and all our registered users with the new details and links to the updated or changed policy.\nIf required by law, we will get your permission or give you the opportunity to opt in to or opt out of, as applicable, any new uses of your personal information.\nIt's not possible for a Customer to remove the small \"Build with Fern\" link that appears in published documentation through tactics, including but not limited to, custom CSS or global JavaScript.\nFor any questions or concerns regarding your privacy, you may contact us using the following details:\nSupport \n‍\nDelight your developers with SDKs and Docs."
}
,
{
    "url": "https://elevenlabs.io/docs/product-guides/overview",
    "text": "Product guides\nAdministration\nTroubleshooting\nOverview\nStep by step worflow guides.\nThis section covers everything from account creation to advanced voice cloning, speech synthesis techniques, dubbing, and expert voiceover.\nDiscover how to create speech from text with text to speech\nDiscover how to transform your voice with voice changer\nDiscover how to create cinematic sound effects from text\nManage long-form content with projects\nDiscover how to dub your videos in multiple languages\nDiscover how to create conversational AI agents\nDiscover how to create instant & professional voice clones\nDiscover our voice library with over 5,000 community voices\nDiscover how to craft voices from a single prompt\nDiscover how to get paid when your voice is used\nDiscover how to get paid when your voice is used\nManage long-form audio generation with voiceover studio\nIsolate voices from background noise\nClassify AI-generated speech\nLearn how to manage your account settings\nLearn how to manage your billing information\nLearn how to manage your enterprise workspaces\nLearn how to enable single sign-on for your enterprise"
}
,
{
    "url": "https://elevenlabs.io/docs/best-practices/prompting",
    "text": "Pauses\nPronunciation\nPhoneme Tags\nAlias Tags\nPronunciation Dictionaries\nPronunciation Dictionary Example\nEmotion\nPace\nTips\nCreative control\nNarrative styling\nLayered outputs\nPhonetic experimentation\nManual adjustments\nFeedback iteration\nPrompting\nLearn how to control delivery, pronunciation & emotion of text to speech.\nWe are actively working on \n to give you even greater control over outputs.\nThis guide provides techniques to enhance text-to-speech outputs using ElevenLabs models. Experiment with these methods to discover what works best for your needs. These techniques provide a practical way to achieve nuanced results until advanced features like \n are rolled out.\nUse \n for natural pauses up to 3 seconds.\nUsing too many break tags in a single generation can cause instability. The AI might speed up, or\nintroduce additional noises or audio artifacts. We are working on resolving this.\nAlternatives to \n include dashes (- or —) for short pauses or ellipses (…) for hesitant tones. However, these are less consistent.\nSpecify pronunciation using \n. Supported alphabets include \n Arpabet and the \n.\nPhoneme tags are only compatible with “Eleven English v1” and “Eleven Turbo v2”\n\n.\nWe recommend using CMU Arpabet for consistent and predictable results with current AI models. While IPA can be effective, CMU Arpabet generally offers more reliable performance.\nPhoneme tags only work for individual words. If for example you have a name with a first and last name that you want to be pronounced a certain way, you will need to create a phoneme tag for each word.\nEnsure correct stress marking for multi-syllable words to maintain accurate pronunciation. For example:\nFor models that don’t support phoneme tags, you can try writing words more phonetically. You can also employ various tricks such as capital letters, dashes, apostrophes, or even single quotation marks around a single letter or letters.\nAs an example, a word like “trapezii” could be spelt “trapezIi” to put more emphasis on the “ii” of the word.\nYou can either replace the word directly in your text, or if you want to specify pronunciation using other words or phrases when using a pronunciation dictionary, you can use alias tags for this. This can be useful if you’re generating using Multilingual v2 or Turbo v2.5, which don’t support phoneme tags. You can use pronunciation dictionaries with Studio, Dubbing Studio and Speech Synthesis via the API.\nFor example, if your text includes a name that has an unusual pronunciation that the AI might struggle with, you could use an alias tag to specify how you would like it to be pronounced:\nIf you want to make sure that an acronym is always delivered in a certain way whenever it is incountered in your text, you can use an alias tag to specify this:\nSome of our tools, such as Studio and Dubbing Studio, allow you to create and upload a pronunciation dictionary. These allow you to specify the pronunciation of certain words, such as character or brand names, or to specify how acronyms should be read.\nPronunciation dictionaries allow this functionality by enabling you to upload a lexicon or dictionary file that specifies pairs of words and how they should be pronounced, either using a phonetic alphabet or word substitutions.\nWhenever one of these words is encountered in a project, the AI model will pronounce the word using the specified replacement.\nTo provide a pronunciation dictionary file, open the settings for a project and upload a file in either TXT or the \n. When a dictionary is added to a project it will automatically recalculate which pieces of the project will need to be re-converted using the new dictionary file and mark these as unconverted.\nCurrently we only support pronunciation dictionaries that specify replacements using phoneme or alias tags.\nBoth phonemes and aliases are sets of rules that specify a word or phrase they are looking for, referred to as a grapheme, and what it will be replaced with. Please note that searches are case sensitive. When checking for a replacement word in a pronunciation dictionary, the dictionary is checked from start to end and only the very first replacement is used.\nHere is an example pronunciation dictionary that specifies in IPA the pronunciation of “Apple” with IPA of “ˈæpl̩” and “UN” with an alias of “United Nations”:\nTo generate a pronunciation dictionary \n file, there are a few open source tools available:\nConvey emotions through narrative context or explicit dialogue tags. This approach helps the AI understand the tone and emotion to emulate.\nExplicit dialogue tags yield more predictable results than relying solely on context, however the model will still speak out the emotional delivery guides. These can be removed in post-production using an audio editor if unwanted.\nPacing can be controlled by writing in a natural, narrative style. For voice cloning, longer, continuous samples are recommended to avoid pacing issues like unnaturally fast speech.\nSample Length: Use longer, continuous samples for voice cloning to avoid pacing issues.\nNarrative Style: Write in a narrative style to naturally control pacing and emotion, similar to scriptwriting.\nInconsistent pauses: Ensure \n syntax is used for\npauses.\nEmotion mismatch: Add narrative context or explicit tags to guide emotion.\n \n\n\nExperiment with alternative phrasing to achieve desired pacing or emotion. For complex sound\neffects, break prompts into smaller, sequential elements and combine results manually.\nWhile we are actively developing a “Director’s Mode” to give users even greater control over outputs, here are some interim techniques to maximize creativity and precision:\nWrite prompts in a narrative style, similar to scriptwriting, to guide tone and pacing effectively.\nGenerate sound effects or speech in segments and layer them together using audio editing software for more complex compositions.\nIf pronunciation isn’t perfect, experiment with alternate spellings or phonetic approximations to achieve desired results.\nCombine individual sound effects manually in post-production for sequences that require precise timing.\nIterate on results by tweaking descriptions, tags, or emotional cues."
}
,
{
    "url": "https://elevenlabs.io/docs/resources/libraries",
    "text": "Official REST API libraries\nConversational AI libraries\nLibraries & SDKs\nExplore language-specific libraries for using the ElevenLabs API.\nElevenLabs provides officially supported libraries that are updated with the latest features available in the \n.\nTest and explore all ElevenLabs API endpoints using our official \n.\nThese libraries are designed for use with ElevenLabs \n."
}
,
{
    "url": "https://buildwithfern.com/privacy-policy",
    "text": "Privacy policy\nInformation We Collect\nLog Data\nDevice Data\nPersonal Information\nLegitimate Reasons for Processing Your Personal Information\nCollection and Use of Information\nSecurity of Your Personal Information\nHow Long We Keep Your Personal Information\nChildren\nInternational Transfers of Personal Information\nYour Rights and Controlling Your Personal Information\nLimits of Our Policy\nChanges to This Privacy Policy\nContact Us\nTable of contents\nPublish client libraries in popular languages.\nAPI documentation tailored to your brand.\nYour privacy is important to us. It is the policy of Birch Solutions, Inc. dba Fern (\"Fern\") to respect your privacy and comply with any applicable law and regulation regarding any personal information we may collect about you, including across our website, \n, and other sites we own and operate.\nPersonal information is any information about you which can be used to identify you. This includes information about you as a person (such as name, address, and date of birth), your devices, payment details, and even information about how you use a website or online service.\nIn the event our site contains links to third-party sites and services, please be aware that those sites and services have their own privacy policies. After following a link to any third-party content, you should read their posted privacy policy information about how they collect and use personal information. This Privacy Policy does not apply to any of your activities after you leave our site.\nThis policy is effective as of August 17, 2022.\nLast updated on July 15, 2025.\nInformation we collect includes both information you knowingly and actively provide us when using or participating in any of our services and promotions, and any information automatically sent by your devices in the course of accessing our products and services. \nWhen you visit or log in to our website, cookies and similar technologies may be used by our online data partners or vendors to associate these activities with other personal information they or others have about you, including by association with your email or home address. We (or service providers on our behalf) may then send communications and marketing to these email or home addresses. You may opt out of receiving this advertising by visiting \nWhen you visit our website, our servers may automatically log the standard data provided by your web browser. It may include your device’s Internet Protocol (IP) address, your browser type and version, the pages you visit, the time and date of your visit, the time spent on each page, and other details about your visit. \nAdditionally, if you encounter certain errors while using the site, we may automatically collect data about the error and the circumstances surrounding its occurrence. This data may include technical details about your device, what you tried to do when the error happened, and other technical information relating to the problem. You may or may not receive notice of such errors, even at the moment they occur, that they have occurred, or what the nature of the error is.\nPlease be aware that while this information may not be personally identifying by itself, it may be possible to combine it with other data to personally identify individual persons.\nWhen you visit our website or interact with our services, we may automatically collect data about your device, such as:\nData we collect can depend on the individual settings of your device and software. We recommend checking the policies of your device manufacturer or software provider to learn what information they make available to us.\nWe may ask for personal information which may include one or more of the following:\nWe only collect and use your personal information when we have a legitimate reason for doing so. In which instance, we only collect personal information that is reasonably necessary to provide our services to you.\nWe may collect personal information from you when you do any of the following on our website:\nWe may collect, hold, use, and disclose information for the following purposes, and personal information will not be further processed in a manner that is incompatible with these purposes:\nPlease be aware that we may combine information we collect about you with general information or research data we receive from other trusted sources.\nWhen we collect and process personal information, and while we retain this information, we will protect it within commercially acceptable means to prevent loss and theft, as well as unauthorized access, disclosure, copying, use, or modification.\nAlthough we will do our best to protect the personal information you provide to us, we advise that no method of electronic transmission or storage is 100% secure, and no one can guarantee absolute data security. We will comply with laws applicable to us in respect of any data breach.\nWe keep your personal information only for as long as we need to. This time period may depend on what we are using your information for, in accordance with this privacy policy. If your personal information is no longer required, we will delete it or make it anonymous by removing all details that identify you.\nHowever, if necessary, we may retain your personal information for our compliance with a legal, accounting, or reporting obligation or for archiving purposes in the public interest, scientific, or historical research purposes or statistical purposes.\nOur Services and website are not intended for, and should not be used by, children under the age of 18. We do not knowingly collect personal data from children under 18.\nThe personal information we collect is stored and/or processed in United States, or where we or our partners, affiliates, and third-party providers maintain facilities.\nThe countries to which we store, process, or transfer your personal information may not have the same data protection laws as the country in which you initially provided the information. If we transfer your personal information to third parties in other countries: (i) we will perform those transfers in accordance with the requirements of applicable law; and (ii) we will protect the transferred personal information in accordance with this privacy policy.\nYou have certain rights in relation to your personal information. These include: the right to object to the processing of your information for certain purposes, the right to access and rectify your personal information, and the ability to erase, restrict or receive a machine-readable copy of your personal information.\nYou always retain the right to withhold personal information from us, with the understanding that your experience of our website may be affected. We will not discriminate against you for exercising any of your rights over your personal information. If you do provide us with personal information you understand that we will collect, hold, use and disclose it in accordance with this privacy policy. You retain the right to request details of any personal information we hold about you.\nIf we receive personal information about you from a third party, we will protect it as set out in this privacy policy. If you are a third party providing personal information about somebody else, you represent and warrant that you have such person’s consent to provide the personal information to us.\nIf you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time. We will provide you with the ability to unsubscribe from our email-database or opt out of communications. Please be aware we may need to request specific information from you to help us confirm your identity.\nIf you believe that any information we hold about you is inaccurate, out of date, incomplete, irrelevant, or misleading, please contact us using the details provided in this privacy policy. We will take reasonable steps to correct any information found to be inaccurate, incomplete, misleading, or out of date.\nIf you believe that we have breached a relevant data protection law and wish to make a complaint, please contact us using the details below and provide us with full details of the alleged breach. We will promptly investigate your complaint and respond to you, in writing, setting out the outcome of our investigation and the steps we will take to deal with your complaint. You also have the right to contact a regulatory body or data protection authority in relation to your complaint.\nYou have the right to request that we erase your personal data. To exercise this data protection right, email us at the address below.\nAt our discretion, we may change our privacy policy to reflect updates to our business processes, current acceptable practices, or legislative or regulatory changes. If we decide to change this privacy policy, we will post the changes here at the same link by which you are accessing this privacy policy.\nIf the changes are significant, or if required by applicable law, we will contact you (based on your selected preferences for communications from us) and all our registered users with the new details and links to the updated or changed policy.\nIf required by law, we will get your permission or give you the opportunity to opt in to or opt out of, as applicable, any new uses of your personal information.\nWe may change this privacy policy at any time. The new privacy policy will be displayed on our website. The date this privacy policy was last updated appears at the top.\nQuestions and comments regarding this privacy policy should be sent to: \n \nOur registered mailing address is:\nFern\n169 Madison Ave #2324\nNew York New York 10016\nUnited States\n‍\nDelight your developers with SDKs and Docs."
}
,
{
    "url": "https://elevenlabs.io/docs/resources/error-messages",
    "text": "Dashboard errors\nAPI errors\nCode 400/401\nCode 403\nCode 429\nError messages\nExplore error messages and solutions.\nThis guide includes an overview of error messages you might see in the ElevenLabs dashboard & API.\nIf error messages persist after following these solutions, please \n for further\nassistance.\nIf error messages persist after following these solutions, please \n for further\nassistance."
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/overview.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\noverview.mdx\nLatest commit\nHistory\nBreadcrumbs\noverview.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-examples",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nLicense\nelevenlabs/elevenlabs-examples\nFolders and files\nLatest commit\nHistory\nRepository files navigation\nElevenLabs Examples\n🚀 Featured Projects\nConversational AI Demos\nText-to-Speech (TTS) Demos\nNative Mac App (Open Source)\nSound Effects Generation\nAudioNative React Demo\nDubbing API Demo\nPronunciation Dictionaries\n🛠 Getting Started\n🤝 Contributing\n📚 Learn More\n📄 License\nAbout\nTopics\nResources\nLicense\nStars\nWatchers\nForks\n\n  \n\n  \n\n  \nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n  \nThis collection of demos and projects showcases the ElevenLabs API and how you can start building next generation AI audio apps with it. Whether you're looking to integrate text-to-speech into your website, create dubbed content, or explore advanced conversational applications, you'll find valuable resources here.\nThese projects offer practical examples of building real-time, voice-driven applications with rich interactivity.\nA fully open-source native Mac application that brings ElevenLabs to your desktop. Written by Claude 3.5 and Cursor.\nUnleash your creativity with our sound effects generation demo. Create custom audio landscapes for your projects!\nEmbed ElevenLabs' text-to-speech capabilities directly into your React-based websites. This demo shows you how to seamlessly integrate our technology for a native-like audio experience.\nDiscover how to use our Dubbing API to create multilingual content effortlessly. Perfect for content creators and localization teams!\nLearn how to work with pronunciation dictionaries to fine-tune the output of our voice models.\nTo get started with these examples:\nFor detailed API documentation and guides, visit our \n.\nWe welcome contributions from the community! Before you start:\nThis project is licensed under the MIT License - see the \n file for details."
}
,
{
    "url": "https://elevenlabs.io/docs/capabilities/sound-effects",
    "text": "Overview\nUsage\nPrompting guide\nFAQ\nSound effects\nLearn how to create high-quality sound effects from text with ElevenLabs.\nElevenLabs \n API turns text descriptions into high-quality audio effects with precise control over timing, style and complexity. The model understands both natural language and audio terminology, enabling you to:\nListen to an example:\nSound effects are generated using text descriptions & two optional parameters:\n: Set a specific length for the generated audio (in seconds)\n: Control how strictly the model follows the prompt\nLearn how to integrate sound effects into your application.\nStep-by-step guide for using sound effects in ElevenLabs.\nFor basic sound effects, use clear, concise descriptions:\nFor multi-part sound effects, describe the sequence of events:\nThe API also supports generation of musical components:\nCommon terms that can enhance your prompts:\nThe maximum duration is 30 seconds per generation. For longer sequences, generate multiple\neffects and combine them.\nYes, you can generate musical elements like drum loops, bass lines, and melodic samples.\nHowever, for full music production, consider combining multiple generated elements.\nUse detailed prompts, appropriate duration settings, and high prompt influence for more\npredictable results. For complex sounds, generate components separately and combine them.\nGenerated audio is provided in MP3 format with professional-grade quality (44.1kHz,\n128-192kbps)."
}
,
{
    "url": "https://elevenlabs.io/docs/capabilities/dubbing",
    "text": "Overview\nUsage\nKey features\nCost\nFAQ\nDubbing\nLearn how to translate audio and video while preserving the emotion, timing & tone of speakers.\nElevenLabs \n API translates audio and video across 32 languages while preserving the emotion, timing, tone and unique characteristics of each speaker. Our model separates each speaker’s dialogue from the soundtrack, allowing you to recreate the original delivery in another language. It can be used to:\nYour browser does not support the video tag.\nWe also offer a \n for video and podcast creators.\nElevenLabs dubbing can be used in two ways:\nThe UI supports files up to \n and \n. The API supports files up to \n and \n.\nLearn how to integrate dubbing into your application.\nEdit transcripts and translate videos step by step in Dubbing Studio.\n\n\nAutomatically detect multiple speakers, even with overlapping speech.\n\n\nGenerate localized tracks in 32 languages.\n\n\nRetain the speaker’s identity and emotional tone.\n\n\nAvoid re-mixing music, effects, or ambient sounds.\n\n\nManually edit translations and transcripts as needed.\n\n\nVideos and audio can be dubbed from various sources, including YouTube, X, TikTok, Vimeo, direct URLs, or file uploads.\n\n\nOur AI video translator lets you manually edit transcripts and translations to ensure your content is properly synced and localized. Adjust the voice settings to tune delivery, and regenerate speech segments until the output sounds just right.\nA Creator plan or higher is required to dub audio files. For videos, a watermark option is\navailable to reduce credit usage.\nTo reduce credit usage, you can:\nRefer to our \n for detailed credit costs.\nDubbing can be performed on all types of short and long form video and audio content. We\nrecommend dubbing content with a maximum of 9 unique speakers at a time to ensure a high-quality\ndub.\nYes. Our models analyze each speaker’s original delivery to recreate the same tone, pace, and\nstyle in your target language.\nWe use advanced source separation to isolate individual voices from ambient sound. Multiple\noverlapping speakers can be split into separate tracks.\nVia the user interface, the maximum file size is 500MB up to 45 minutes. Through the API, you\ncan process files up to 1GB and 2.5 hours.\nYou can choose to dub only certain portions of your video/audio or tweak translations/voices in\nour interactive Dubbing Studio."
}
,
{
    "url": "https://elevenlabs.io/docs/capabilities/voice-changer",
    "text": "Overview\nSupported languages\nBest practices\nAudio quality\nRecording guidelines\nParameters\nFAQ\nVoice changer\nLearn how to transform audio between voices while preserving emotion and delivery.\nElevenLabs \n API lets you transform any source audio (recorded or uploaded) into a different, fully cloned voice without losing the performance nuances of the original. It’s capable of capturing whispers, laughs, cries, accents, and subtle emotional cues to achieve a highly realistic, human feel and can be used to:\nYour browser does not support the video tag.\nExplore our \n to find the perfect voice for your project.\nLearn how to integrate voice changer into your application.\nStep-by-step guide for using voice changer in ElevenLabs.\nOur v2 models support 29 languages:\nThe \n model only supports English.\nYes, but you must split it into smaller chunks (each under 5 minutes). This helps ensure stability\nand consistent output.\nAbsolutely. Provide your custom voice’s \n and specify the correct\n \n\n\n.\nYou’re charged at 1000 characters’ worth of usage per minute of processed audio. There’s no\nadditional fee based on file size.\nPossibly. Use \n or the Voice Isolator tool to minimize\nenvironmental sounds in the final output.\nThough \n is available, our\n \n\n\n model often outperforms it, even for English material.\n“Style” adds interpretative flair; “stability” enforces consistency. For high-energy performances\nin the source audio, turn style down and stability up."
}
,
{
    "url": "https://elevenlabs.io/docs/capabilities/text-to-speech",
    "text": "Overview\nVoice quality\nVoice options\nSupported formats\nSupported languages\nPrompting\nFAQ\nText to Speech\nLearn how to turn text into lifelike spoken audio with ElevenLabs.\nElevenLabs \n API turns text into lifelike audio with nuanced intonation, pacing and emotional awareness. \n adapt to textual cues across 32 languages and multiple voice styles and can be used to:\nListen to a sample:\nExplore our \n to find the perfect voice for your project.\nLearn how to integrate text to speech into your application.\nStep-by-step guide for using text to speech in ElevenLabs.\nFor real-time applications, Flash v2.5 provides ultra-low 75ms latency, while Multilingual v2 delivers the highest quality audio with more nuanced expression.\nOur most lifelike, emotionally rich speech synthesis model\nOur fast, affordable speech synthesis model\nElevenLabs offers thousands of voices across 32 languages through multiple creation methods:\nLearn more about our \n.\nThe default response format is “mp3”, but other formats like “PCM”, & “μ-law” are available.\nHigher quality audio options are only available on paid tiers - see our \n for details.\nOur v2 models support 29 languages:\nFlash v2.5 supports 32 languages - all languages from v2 models plus:\nSimply input text in any of our supported languages and select a matching voice from our \n. For the most natural results, choose a voice with an accent that matches your target language and region.\nThe models interpret emotional context directly from the text input. For example, adding\ndescriptive text like “she said excitedly” or using exclamation marks will influence the speech\nemotion. Voice settings like Stability and Similarity help control the consistency, while the\nunderlying emotion comes from textual cues.\nRead the \n for more details.\nDescriptive text will be spoken out by the model and must be manually trimmed or removed from the\naudio if desired.\nYes, you can create \n of your own voice\nfrom short audio clips. For high-fidelity clones, check out our \n feature.\nYes. You retain ownership of any audio you generate. However, commercial usage rights are only\navailable with paid plans. With a paid subscription, you may use generated audio for commercial\npurposes and monetize the outputs if you own the IP rights to the input content.\nA free regeneration allows you to regenerate the same text to speech content without additional cost, subject to these conditions:\nFree regenerations are useful in case there is a slight distortion in the audio output. According to ElevenLabs’ internal benchmarks, regenerations will solve roughly half of issues with quality, with remaining issues usually due to poor training data.\nUse the low-latency Flash \n (Flash v2 or v2.5) optimized for near real-time\nconversational or interactive scenarios. See our \n for more details.\nThe models are nondeterministic. For consistency, use the optional \n, though subtle\ndifferences may still occur.\nSplit long text into segments and use streaming for real-time playback and efficient processing.\nTo maintain natural prosody flow between chunks, include \n."
}
,
{
    "url": "https://elevenlabs.io/docs/capabilities/voice-isolator",
    "text": "Overview\nUsage\nSupported file types\nFAQ\nVoice isolator\nLearn how to isolate speech from background noise, music, and ambient sounds from any audio.\nElevenLabs \n API transforms audio recordings with background noise into clean, studio-quality speech. This is particularly useful for audio recorded in noisy environments, or recordings containing unwanted ambient sounds, music, or other background interference.\nListen to a sample:\nThe voice isolator model extracts speech from background noise in both audio and video files.\nLearn how to integrate voice isolator into your application.\nStep-by-step guide for using voice isolator in ElevenLabs."
}
,
{
    "url": "https://buildwithfern.com/learn/docs/getting-started/overview",
    "text": "Key Features\nFern Docs Overview\nA static site generator for developer-focused companies to build and host a beautiful, professional docs site.\nFern Docs provides versatile documentation to support all your content needs, including popular formats like:\nMatch your docs to your brand with customizable colors, fonts, and styles.\nAuto-generate API docs from OpenAPI and AsyncAPI specs.\nVersion and manage docs with your Git provider using Markdown or MDX.\nTest APIs directly in the docs with auto-populated credentials.\nExample code auto-updates as your SDKs evolve.\nUse pre-built or custom React components for a polished look."
}
,
{
    "url": "https://github.com/fern-api/fern",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nLicense\nfern-api/fern\nFolders and files\nLatest commit\nHistory\nRepository files navigation\n🌿 SDKs\n🌿 API Documentation\n🌿 Generators\nSDK Generators\nServer-side Generators\nModel Generators\nSpec Generators\n🌿 CLI Commands\nAdvanced\nAPI First\nFern Definition\nInspiration\nCommunity\nContributing\nAbout\nTopics\nResources\nLicense\nStars\nWatchers\nForks\n\n  \n\n  \nLanguages\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n        Input OpenAPI. Output SDKs and Docs.\n      \n\n\n\n\nFern is a toolkit that allows you to input your API Definition and output SDKs and API documentation. Fern is compatible with the OpenAPI specification (formerly Swagger).\nThe Fern toolkit is available via a command line interface (CLI) and requires Node 18+. To install it, run:\nInitialize Fern with your OpenAPI spec:\nYour directory should look like the following:\nFinally, to invoke the generator, run:\n🎉 Once the command completes, you'll see your SDK in \n.\nFern can also build and host a documentation website with an auto-generated API reference. Write additional pages in markdown and have them versioned with git. Search, SEO, dark mode, and popular components are provided out-of-the-box. Plus, you can customize the colors, font, logo, and domain name.\nCheck out docs built with Fern:\nGet started \n.\nGenerators are process that take your API Definition as input and output artifacts (SDKs,\nPostman Collections, Server boilerplate, etc.). To add a generator run \nFern's server-side generators output boilerplate application code (models and networking logic). This is intended for spec-first or API-first developers, who write their API definition (as an OpenAPI spec or Fern definition) and want to generate backend code.\nFern's model generators will output schemas or types defined in your OpenAPI spec or Fern Definition.\nFern's spec generators can output an OpenAPI spec or a Postman collection.\n: The OpenAPI spec generator is primarily intended for Fern Definition users. This prevents lock-in so that one can always export to OpenAPI.\nHere's a quick look at the most popular CLI commands. View the documentation for \n.\n: adds a new starter API to your repository.\n: validate your API definition and Fern configuration.\n: run the generators specified in \n in the cloud.\n: run the generators specified in \n in docker locally.\n: include a new generator in your \n. For example, \n.\nFern supports developers and teams that want to be API-first or Spec-first.\nDefine your API, and use Fern to generate models, networking code and boilerplate application code. The generated code adds\ntype safety to your API implementation - if your backend doesn't implement the API correctly, it won't compile.\nFrameworks currently supported:\nWhile we are big fans of OpenAPI, we know it isn't the \n format to read and write. If you're looking for an alternative,\ngive the Fern Definition a try.\nInstall the Fern CLI and initialize a Fern Project.\nThis will create the following folder structure in your project:\nHere's what the \n starter file looks like:\nCheckout open source projects that are using Fern Definitions:\nFern is inspired by internal tooling built to enhance the developer experience. We stand on the shoulders of giants. While teams were responsible for building the following tools, we want to give a shout out to Mark Elliot (creator of Conjure at Palantir), Michael Dowling (creator of Smithy at AWS), and Ian McCrystal (creator of Stripe Docs).\n We are here to answer questions and help you get the most out of Fern.\nWe welcome community contributions. For guidelines, refer to our \n.\n\n        Input OpenAPI. Output SDKs and Docs."
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/resources/zero-retention.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\nzero-retention.mdx\nLatest commit\nHistory\nBreadcrumbs\nzero-retention.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/resources/libraries.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\nlibraries.mdx\nLatest commit\nHistory\nBreadcrumbs\nlibraries.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/best-practices/prompting.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\nprompting.mdx\nLatest commit\nHistory\nBreadcrumbs\nprompting.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/resources/error-messages.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\nerror-messages.mdx\nLatest commit\nHistory\nBreadcrumbs\nerror-messages.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://github.com/cahyosubroto",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\n\n        \n\n        \n\n      \n\n        Block or report cahyosubroto\n      \n\n      Pinned\n    \n\n    \n\n  \nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n  \n\n\n\n            Prevent this user from interacting with your repositories and sending you notifications.\n          Learn more about \n.\n        \n\n              You must be logged in to block users.\n            \n\n        Contact GitHub support about this user’s behavior.\n        Learn more about \n.\n      \n\n        \n      \n\n          \n\n\n      \n\n        \n      \n\n          \n\n\n      \n\n        \n      \n\n          \n\n\n      \n\n        Jan is an open source alternative to ChatGPT that runs 100% offline on your computer\n      \n\n          \n\n\n          \n\n          \n\n      \n\n          Forked from \n\n        \n\n        Documentation for elevenlabs.io/docs\n      \n\n          \n\n\n      \n\n          Forked from"
}
,
{
    "url": "https://github.com/x0m4ek",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\n\n        \n\n        \n\n      \n\n        Block or report x0m4ek\n      \n🌐 Socials:\n💻 Tech Stack:\n📊 GitHub Stats:\n\n      Pinned\n    \n\n    \n\n  \nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n  \n\n\n\n            Prevent this user from interacting with your repositories and sending you notifications.\n          Learn more about \n.\n        \n\n              You must be logged in to block users.\n            \n\n        Contact GitHub support about this user’s behavior.\n        Learn more about \n."
}
,
{
    "url": "https://github.com/nevflynn",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\n\n        \n\n        \n\n      \n\n        Block or report nevflynn\n      \n\n      Pinned\n    \n\n    \n\n  \nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n  \n\n\n\n            Prevent this user from interacting with your repositories and sending you notifications.\n          Learn more about \n.\n        \n\n              You must be logged in to block users.\n            \n\n        Contact GitHub support about this user’s behavior.\n        Learn more about \n.\n      \n\n        \n      \n\n          \n\n          \n\n      \n\n        Documentation for elevenlabs.io/docs\n      \n\n          \n\n\n          \n\n          \n\n      \n\n        \n      \n\n          \n\n\n          \n\n          \n\n      \n\n        Evervault JavaScript SDK."
}
,
{
    "url": "https://github.com/genecyber",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\n\n        \n\n        \n\n      \nHighlights\nOrganizations\n\n        Block or report genecyber\n      \n\n      Pinned\n    \n\n    \n\n  \nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n  \n\n\n\n            Prevent this user from interacting with your repositories and sending you notifications.\n          Learn more about \n.\n        \n\n              You must be logged in to block users.\n            \n\n        Contact GitHub support about this user’s behavior.\n        Learn more about \n.\n      \n\n        Brute force encrypted Copay Blobs\n      \n\n          \n\n\n          \n\n      \n\n        Test Driven BlackJack Game Written in .NET\n      \n\n          \n\n\n          \n\n      \n\n        \n      \n\n          \n\n\n          \n\n      \n\n        My genome sequenced and published by 23AndMe"
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/capabilities/sound-effects.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\nsound-effects.mdx\nLatest commit\nHistory\nBreadcrumbs\nsound-effects.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://github.com/lacop11",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\n\n        \n\n        \n\n      \nOrganizations\n\n        Block or report lacop11\n      \n\n      Popular repositories\n    \n\n    \n\n  \nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n  \n\n\n\n            Prevent this user from interacting with your repositories and sending you notifications.\n          Learn more about \n.\n        \n\n              You must be logged in to block users.\n            \n\n        Contact GitHub support about this user’s behavior.\n        Learn more about \n.\n      \n\n            \n          \n\n              \n\n\n              \n\n          \n\n            \n          \n\n              \n\n\n          \n\n              Forked from \n\n            \n\n            A pre-commit hook to check if poetry dependencies are pinned"
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/capabilities/dubbing.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\ndubbing.mdx\nLatest commit\nHistory\nBreadcrumbs\ndubbing.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://elevenlabs.io/docs/api-reference/text-to-sound-effects/convert",
    "text": "Create sound effect\nRequest\nResponse\nErrors\nTurn text into sound effects for your videos, voice-overs or video games using the most advanced sound effects model in the world.\nThe text that will get converted into a sound effect.\nThe duration of the sound which will be generated in seconds. Must be at least 0.5 and at most 22. If set to None we will guess the optimal duration using the prompt. Defaults to None.\nA higher prompt influence makes your generation follow the prompt more closely while also making generations less variable. Must be a value between 0 and 1. Defaults to 0.3.\nSuccessful Response"
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/capabilities/voice-changer.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\nvoice-changer.mdx\nLatest commit\nHistory\nBreadcrumbs\nvoice-changer.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/capabilities/text-to-speech.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\ntext-to-speech.mdx\nLatest commit\nHistory\nBreadcrumbs\ntext-to-speech.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://github.com/elevenlabs/elevenlabs-docs/blob/main/fern/docs/pages/capabilities/voice-isolator.mdx?plain=1",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nBreadcrumbs\nvoice-isolator.mdx\nLatest commit\nHistory\nBreadcrumbs\nvoice-isolator.mdx\nFile metadata and controls\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://elevenlabs.io/voice-library",
    "text": "Voice Library\nCharacter types\nEmotional styles\nVoice qualities\nProfessional styles\nDefault collections\nEarn money and help shape the future of AI audio\nExplore our resources to kickstart your creativity\nWe crossed $1M in Voice Library Payouts\nHow to Clone Your Voice (2025 Guide)\nHow to use AI as a voice actor\nWhat is Voice Cloning?\nHow much do voice actors make?\nFooter\nDiscover the AI audio community where you can innovate, collaborate, and earn. From audiobook narrators to unique characters and everything in between, Voice Library has the best voices for your project\nPayouts\nShare your voice in Voice Library, set your terms, and earn cash rewards when others use it. We've paid out over $1M this year\nWe instituted Voice Library payouts in February this year to incentivize the growth of our library and ensure that anyone can get compensated for their voice.\nLearn the exact steps to cloning your voice using the latest AI voice cloning technology.\nIs it possible for voice actors to use AI tools for good? Here are 5 ways they can.\nDiscover the basics of voice cloning.\nLearn how much voice actors can expect to make and how to create passive income streams with ElevenLabs.\nCreate with the highest quality AI Audio\nResearch\nProducts\nSolutions\nEarn As\nResources\nCompany\nReach everyone with AI audio\n© 2025 ElevenLabs"
}
,
{
    "url": "https://github.com/cahyosubroto/elevenlabs-examples",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nLicense\ncahyosubroto/elevenlabs-examples\nFolders and files\nLatest commit\nHistory\nRepository files navigation\nElevenLabs Examples\nTutorials\nContributing\nAbout\nResources\nLicense\nStars\nWatchers\nForks\n\n  \n\n  \nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \nVisit the \n to view the tutorials\nBefore contributing please install the pre-commit hook with:"
}
,
{
    "url": "https://github.com/janhq/jan",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nLicense\njanhq/jan\nFolders and files\nLatest commit\nHistory\nRepository files navigation\nJan - Local AI Assistant\nDownload\nDemo\nQuicklinks\nJan\nCortex.cpp\nRequirements for running Jan\nTroubleshooting\nContributing\nPre-requisites\nInstructions\nFor production build\nAcknowledgements\nContact\nTrust & Safety\nLicense\nAbout\nTopics\nResources\nLicense\nStars\nWatchers\nForks\n\n  \n\n  \n\n  \nLanguages\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n        Jan is an open source alternative to ChatGPT that runs 100% offline on your computer\n      \n\n  \n  \n\n  \n\n  \n\n  \n\n  \n\n\n\n  \n \n  - \n \n  - \n \n  - \n \n  - \n\n\n\n\n \n: Expect breaking changes and bugs!\n\nJan is a ChatGPT-alternative that runs 100% offline on your device. Our goal is to make it easy for a layperson to download and run LLMs and use AI with \n and \n.\nJan is powered by \n, our embeddable local AI engine that runs on any hardware.\nFrom PCs to multi-GPU clusters, Jan & Cortex supports universal architectures:\nDownload the latest version of Jan at \n or visit the \n to download any previous release.\nJan is powered by \n. It is a C++ command-line interface (CLI) designed as an alternative to \n. By default, it runs on the llama.cpp engine but also supports other engines, including ONNX and TensorRT-LLM, making it a multi-engine platform.\nAs Jan is in development mode, you might get stuck on a some common issues:\nIf you can't find what you need in our troubleshooting guide, feel free reach out to us for extra help:\nContributions are welcome! Please read the \n file\nThis will start the development server and open the desktop app.\nThis will build the app MacOS m1/m2 for production (with code signing already done) and put the result in \n folder.\nJan builds on top of other open-source projects:\nBeware of scams!\nJan is free and open source, under the \n license.\n\n        Jan is an open source alternative to ChatGPT that runs 100% offline on your computer"
}
,
{
    "url": "https://github.com/cahyosubroto/twilio-checkinroom",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\ncahyosubroto/twilio-checkinroom\nFolders and files\nLatest commit\nHistory\nRepository files navigation\nAbout Laravel\nLearning Laravel\nLaravel Sponsors\nPremium Partners\nContributing\nCode of Conduct\nSecurity Vulnerabilities\nLicense\nAbout\nResources\nStars\nWatchers\nForks\n\n  \n\n  \nLanguages\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n\n\n\n\n\n\n\n\n\nLaravel is a web application framework with expressive, elegant syntax. We believe development must be an enjoyable and creative experience to be truly fulfilling. Laravel takes the pain out of development by easing common tasks used in many web projects, such as:\nLaravel is accessible, powerful, and provides tools required for large, robust applications.\nLaravel has the most extensive and thorough \n and video tutorial library of all modern web application frameworks, making it a breeze to get started with the framework.\nYou may also try the \n, where you will be guided through building a modern Laravel application from scratch.\nIf you don't feel like reading, \n can help. Laracasts contains over 2000 video tutorials on a range of topics including Laravel, modern PHP, unit testing, and JavaScript. Boost your skills by digging into our comprehensive video library.\nWe would like to extend our thanks to the following sponsors for funding Laravel development. If you are interested in becoming a sponsor, please visit the Laravel \n.\nThank you for considering contributing to the Laravel framework! The contribution guide can be found in the \n.\nIn order to ensure that the Laravel community is welcoming to all, please review and abide by the \n.\nIf you discover a security vulnerability within Laravel, please send an e-mail to Taylor Otwell via \n. All security vulnerabilities will be promptly addressed.\nThe Laravel framework is open-sourced software licensed under the \n."
}
,
{
    "url": "https://github.com/cahyosubroto/elevenlabs-docs",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\ncahyosubroto/elevenlabs-docs\nFolders and files\nLatest commit\nHistory\nRepository files navigation\nMintlify Starter Kit\n👩‍💻 Development\n😎 Publishing Changes\nAbout\nResources\nStars\nWatchers\nForks\n\n  \n\n  \nLanguages\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n        Documentation for elevenlabs.io/docs\n      \nUsed to create our \n documentation.\nClick on \n to copy the Mintlify starter kit. The starter kit contains examples including\nInstall the \n to preview the documentation changes locally. To install, use the following command\nRun the following command at the root of your documentation (where mint.json is)\nChanges will be deployed to production automatically after pushing to the default branch.\nYou can also preview changes using PRs, which generates a preview link of the docs.\n\n        Documentation for elevenlabs.io/docs"
}
,
{
    "url": "https://github.com/cahyosubroto/penateam",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\ncahyosubroto/penateam\nFolders and files\nLatest commit\nHistory\nRepository files navigation\npenateam\nAbout\nResources\nStars\nWatchers\nForks\n\n  \n\n  \nLanguages\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://github.com/genecyber/ShannonCodeGenome",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\ngenecyber/ShannonCodeGenome\nFolders and files\nLatest commit\nHistory\nRepository files navigation\nShannonCodeGenome\nAbout\nResources\nStars\nWatchers\nForks\n\n  \n\n  \nLanguages\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n        My genome sequenced and published by 23AndMe\n      \nMy genome sequenced and published by 23AndMe\nEncoded into Bitcoin Blockchain using Factom\n\n\n        My genome sequenced and published by 23AndMe"
}
,
{
    "url": "https://elevenlabs.io/docs/api-reference/websocket",
    "text": "When to use\nWhen not to use\nProtocol\nStreaming input text\nClose connection\nStreaming output audio\nPath parameters\nQuery parameters\nExample - Voice streaming using ElevenLabs and OpenAI\nExample - Other examples for interacting with our Websocket API\nExample - Getting word start times using alignment values\nUnderstanding how our websockets buffer text\nWebsocket\nThis API provides real-time \n conversion using WebSockets. This allows you to send a text message and receive audio data back in real-time.\nThe Text-to-Speech Websockets API is designed to generate audio from partial text input while ensuring consistency throughout the generated audio. Although highly flexible, the Websockets API isn’t a one-size-fits-all solution. It’s well-suited for scenarios where:\nFor a practical demonstration of using ElevenLabs Text to Speech Websockets API, refer to the \n.\nHowever, it may not be the best choice when:\nIn these cases, use the \n instead.\nThe WebSocket API uses a bidirectional protocol that encodes all messages as JSON objects.\nThe client can send messages with text input to the server. The messages can contain the following fields:\nShould always end with a single space string \n. In the first message, the text should be a\nspace \n.\nThis is an advanced setting that most users shouldn’t need to use. It relates to our generation schedule explained \n.\nUse this to attempt to immediately trigger the generation of audio, overriding the \n. Unlike flush, \n will only generate audio if our \n contains more than a minimum threshold of characters, this is to ensure a higher quality response from our model.\nNote that overriding the chunk schedule to generate small amounts of text may result in lower quality audio, therefore, only use this parameter if you really need text to be processed immediately. We generally recommend keeping the default value of \n and adjusting the \n in the \n instead.\nThis property should only be provided in the first message you send.\nDefines the stability for voice settings.\nDefines the similarity boost for voice settings.\nDefines the style for voice settings. This parameter is available on V2+ models.\nDefines the use speaker boost for voice settings. This parameter is available on V2+ models.\nThis property should only be provided in the first message you send.\nThis is an advanced setting that most users shouldn’t need to use. It relates to our generation schedule explained \n.\nDetermines the minimum amount of text that needs to be sent and present in our buffer before audio starts being generated. This is to maximise the amount of context available to the model to improve audio quality, whilst balancing latency of the returned audio chunks.\nThe default value is: [120, 160, 250, 290].\nThis means that the first chunk of audio will not be generated until you send text that totals at least 120 characters long. The next chunk of audio will only be generated once a further 160 characters have been sent. The third audio chunk will be generated after the next 250 characters. Then the fourth, and beyond, will be generated in sets of at least 290 characters.\nCustomize this array to suit your needs. If you want to generate audio more frequently to optimise latency, you can reduce the values in the array. Note that setting the values too low may result in lower quality audio. Please test and adjust as needed.\nEach item should be in the range 50-500.\nFlush forces the generation of audio. Set this value to \n when you have finished sending text, but want to keep the websocket connection open.\nThis is useful when you want to ensure that the last chunk of audio is generated even when the length of text sent is smaller than the value set in \n (e.g. 120 or 50).\nTo understand more about how our websockets buffer text before audio is generated, please refer to \n section.\nProvide the XI API Key in the first message if it’s not in the header.\nAuthorization bearer token. Should be provided only in the first message if not present in the\nheader and the XI API Key is not provided.\nFor best latency we recommend streaming word-by-word, this way we will start generating as soon as\nwe reach the predefined number of un-generated characters.\nIn order to close the connection, the client should send an End of Sequence (EOS) message. The EOS message should always be an empty string:\nShould always be an empty string \n.\nThe server will always respond with a message containing the following fields:\nA generated partial audio chunk, encoded using the selected output_format, by default this is MP3\nencoded as a base64 string.\nIndicates if the generation is complete. If set to \n, \n will be null.\nAlignment information for the generated audio given the input normalized text sequence.\nA list of starting times (in milliseconds) for each character in the normalized text as it\ncorresponds to the audio. For instance, the character ‘H’ starts at time 0 ms in the audio. Note\nthese times are relative to the returned chunk from the model, and not the full audio response.\nSee an example \n for how to use\nthis.\nA list providing the duration (in milliseconds) for each character’s pronunciation in the audio.\nFor instance, the character ‘H’ has a pronunciation duration of 3 ms.\nThe list of characters in the normalized text sequence that corresponds with the timings and durations. This list is used to map the characters to their respective starting times and durations.\nAlignment information for the generated audio given the original text sequence.\nA list of starting times (in milliseconds) for each character in the original text as it\ncorresponds to the audio. For instance, the character ‘H’ starts at time 0 ms in the audio. Note\nthese times are relative to the returned chunk from the model, and not the full audio response.\nSee an example \n for how to use\nthis.\nA list providing the duration (in milliseconds) for each character’s pronunciation in the audio.\nFor instance, the character ‘H’ has a pronunciation duration of 3 ms.\nThe list of characters in the original text sequence that corresponds with the timings and durations. This list is used to map the characters to their respective starting times and durations.\nVoice ID to be used, you can use \n to list all the\navailable voices.\nIdentifier of the model that will be used, you can query them using \n.\nLanguage code (ISO 639-1) used to enforce a language for the model. Currently only our v2.5 Flash & Turbo v2.5 models support language enforcement. For other models, an error will be returned if language code is provided.\nWhether to enable request logging, if disabled the request will not be present in history nor bigtable.\nEnabled by default. Note: simple logging (aka printing) to stdout/stderr is always enabled.\nWhether to enable/disable parsing of SSML tags within the provided text. For best results, we recommend\nsending SSML tags as fully contained messages to the websockets endpoint, otherwise this may result in additional latency.\nPlease note that rendered text, in normalizedAlignment, will be altered in support of SSML tags. The\nrendered text will use a . as a placeholder for breaks, and syllables will be reported using the CMU arpabet alphabet where SSML phoneme tags are used to specify pronunciation.\nDisabled by default.\nYou can turn on latency optimizations at some cost of quality. The best possible final latency varies by model. Possible values:\nDefaults to \nOutput format of the generated audio. Must be one of:\nDefaults to \nThe number of seconds that the connection can be inactive before it is automatically closed.\nDefaults to \n seconds, with a maximum allowed value of \n seconds.\nThe audio for each text sequence is delivered in multiple chunks. By default when it’s set to\nfalse, you’ll receive all timing data (alignment information) with the first chunk only. However,\nif you enable this option, you’ll get the timing data with every audio chunk instead. This can\nhelp you precisely match each audio segment with its corresponding text.\nThis parameter focuses on reducing the latency by disabling the chunk schedule and all buffers. It\nis only recommended when sending full sentences or phrases, sending partial phrases will result in\nhighly reduced quality. By default it’s set to false.\nThe following example demonstrates how to leverage the ElevenLabs Websockets API to stream input from OpenAI’s GPT model, while the answer is being generated, thereby minimizing the overall latency of the operation.\nSome examples for interacting with the Websocket API in different ways are provided below\nThis code example shows how the start times of words can be retrieved using the alignment values returned from our API.\nOur websocket service incorporates a buffer system designed to optimize the Time To First Byte (TTFB) while maintaining high-quality streaming.\nAll text sent to the websocket endpoint is added to this buffer and only when that buffer reaches a certain size is an audio generation attempted. This is because our model provides higher quality audio when the model has longer inputs, and can deduce more context about how the text should be delivered.\nThe buffer ensures smooth audio data delivery and is automatically emptied with a final audio generation either when the stream is closed, or upon sending a \n command. We have advanced settings for changing the chunk schedule, which can improve latency at the cost of quality by generating audio more frequently with smaller text inputs."
}
,
{
    "url": "https://github.com/genecyber/iBody",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\ngenecyber/iBody\nFolders and files\nLatest commit\nHistory\nAbout\nStars\nWatchers\nForks\n\n  \n\n  \nLanguages\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n."
}
,
{
    "url": "https://elevenlabs.io/docs/api-reference/text-to-speech/v-1-text-to-speech-voice-id-stream-input",
    "text": "WebSockets\nPath parameters\nQuery parameters\nThe unique identifier for the voice to use in the TTS process.\nThe model ID to use\nThe ISO 639-1 language code (for Turbo v2.5 and Flash v2.5 models only)\nWhether to enable logging of the request\nWhether to enable SSML parsing\nLatency optimization level (deprecated)\nThe output audio format\nTimeout for inactivity before connection is closed\nWhether to include timing data with every audio chunk\nThis parameter focuses on reducing the latency by disabling the chunk schedule and all buffers. It is only recommended when sending full sentences or phrases, sending partial phrases will result in highly reduced quality. By default it’s set to false."
}
,
{
    "url": "https://elevenlabs.io/docs/api-reference/streaming",
    "text": "Streaming\nThe ElevenLabs API supports real-time audio streaming for select endpoints, returning raw audio bytes (e.g., MP3 data) directly over HTTP using chunked transfer encoding. This allows clients to process or play audio incrementally as it is generated.\nOur official \n and \n libraries include utilities to simplify handling this continuous audio stream.\nStreaming is supported for the \n, \n & \n. This section focuses on how streaming works for requests made to the Text to Speech API.\nIn Python, a streaming request looks like:\nIn Node / Typescript, a streaming request looks like:"
}
,
{
    "url": "https://elevenlabs.io/terms-of-use",
    "text": "ElevenLabs Terms of Service (non-EEA)\nFooter\nLast Updated: 5 December 2024\nThese ElevenLabs Terms of Service (“\n”) are between you (“\n” or “\n”) and Eleven Labs Inc. (“\n”, “\n”, “\n”, or “\n”). By accessing or using our Services (defined below) in any way, by completing the account registration process, or by browsing the Website (defined below), you agree to be bound by these Terms. These Terms apply to your access to and use of the ElevenLabs:\nIF YOU SUBSCRIBE TO ANY FEATURE OR FUNCTIONALITY OF THE SERVICES FOR A TERM (THE “\n \n”), THEN YOUR SUBSCRIPTION WILL BE AUTOMATICALLY RENEWED FOR ADDITIONAL PERIODS OF THE SAME DURATION AS THE INITIAL TERM AT ELEVENLABS’ THEN-CURRENT FEE FOR SUCH FEATURES AND FUNCTIONALITY UNLESS YOU DECIDE NOT TO RENEW YOUR SUBSCRIPTION IN ACCORDANCE WITH SECTION 6(A) BELOW.\nSECTION 12 CONTAINS PROVISIONS THAT GOVERN HOW TO RESOLVE DISPUTES BETWEEN YOU AND ELEVENLABS. ADDITIONALLY, SECTION 12 INCLUDES AN AGREEMENT TO ARBITRATE WHICH REQUIRES, WITH LIMITED EXCEPTIONS, THAT ALL DISPUTES BETWEEN YOU AND ELEVENLABS SHALL BE RESOLVED BY BINDING AND FINAL ARBITRATION. SECTION 12 ALSO CONTAINS A CLASS ACTION AND JURY TRIAL WAIVER. PLEASE READ SECTION 12 CAREFULLY. UNLESS YOU OPT OUT OF ARBITRATION WITHIN THIRTY (30) DAYS AS SET FORTH IN SECTION 12: (1) YOU WILL ONLY BE PERMITTED TO PURSUE DISPUTES OR CLAIMS AND SEEK RELIEF AGAINST ELEVENLABS ON AN INDIVIDUAL BASIS, NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY CLASS OR REPRESENTATIVE ACTION OR PROCEEDING, AND YOU WAIVE YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION LAWSUIT OR CLASS-WIDE ARBITRATION; AND (2) YOU ARE WAIVING YOUR RIGHT TO PURSUE DISPUTES OR CLAIMS AND SEEK RELIEF IN A COURT OF LAW AND TO HAVE A JURY TRIAL.\nWe may indicate that different or additional terms, conditions, guidelines, policies, or rules apply in relation to your access to and use of some or all of our Services (\"\n \n\"), including:\nAny Supplemental Terms become part of your agreement with us if you use the applicable Services, and if there is a conflict between these Terms and the Supplemental Terms, the Supplemental Terms will control for that conflict. We may make changes to these Terms. The “Last Updated” date above indicates when these Terms were last changed. If we make future changes, we may provide you with notice of those changes by any reasonable means, such as by sending an email, providing a notice through our Services, or updating the date at the top of these Terms. Unless we say otherwise in our notice, the amended Terms will be effective immediately, and your continued use of our Services after we provide such notice will confirm your acceptance of the changes. If you do not agree to the amended Terms, you must immediately stop using our Services.\n If you are under 18 years of age (or the age of legal majority where you live), you may not use our Services\n If you register, access or use our Services on behalf of another person or entity, (i) all references to “you” throughout these Terms (other than in this Section 1(a)) will include that person or entity, (ii) you represent that you are authorized to enter into these Terms on that person’s or entity’s behalf, and (iii) in the event you or that person or entity violates these Terms, that person or entity also agrees to be responsible to us. If you are an entity using any Services pursuant to these Terms, you are responsible for your employees’ and representatives’ use of the Services, including ensuring they comply with these Terms.\n Your access to and use of the Services and your use of any Output (defined below) must comply with these Terms. Without limiting the forgoing: (i) if you access or use our Services free of charge (such a user, a “\n \n”), you may only use the Services for non-commercial purpose; (ii) if you access or use our Services through a paid subscription plan (such a user, a “\n \n”), you may use the Services for commercial purposes, but in either case, your access and use of the Services and any Output must still comply with the Prohibited Use Policy.\nYou may provide certain information to ElevenLabs in connection with your access to or use of our Services, or we may otherwise collect certain information about you when you access or use our Services. You agree to receive communications from ElevenLabs via the Services using the email address or other contact information you provide in connection with the Services. You represent and warrant that any information that you provide to ElevenLabs in connection with the Services is accurate. For information about how we collect, use, share, and otherwise process information about you, please review our \n.In addition, where you agree to these terms on behalf of an entity, you agree that the \n governs ElevenLabs’s processing of any personal data contained within any content you input to our Services. You acknowledge that ElevenLabs may process personal data relating to the operation, support, or use of our Services for our own business purposes, such as billing, account management, data analysis, benchmarking, technical support, product development, research and development of its AI models, improvement of its systems and technologies, and compliance with law.\nWe may require that you create an account in order to use some or all of our Services. You may not share or permit others to use your individual account credentials. You will promptly update any information contained in your account if it changes. You must maintain the security of your account, as applicable, and promptly notify us if you discover or suspect that someone has accessed your account without your permission. If your account is closed or terminated, you will forfeit all unused credits related to our Services (including character credits) associated with your account.\nYou may transmit or otherwise provide data and information as input to our Services (\"\n\"). When you provide Input to the Services, you may receive audio output generated and returned by one or more ElevenLabs Voice Models (defined below), or text output generated and returned by one or more ElevenLabs LLMs (defined below), based on Input (“\n”) (Input and Output, collectively, the “\n”). Input may include, without limitation, recordings of your voice, text descriptions, or any other content that you may provide to us through the Services. Your access to and use of the Services, including for the purposes of providing Input to the Services and receiving and using the Output from the Services, is subject to our Prohibited Use Policy. We may enable you to download Output from some (but not all) of the Services; in such cases, you are permitted to use such Output outside of the Services but always subject to these Terms and our Prohibited Use Policy. If you choose to make any of your information publicly available through the Services or otherwise, you do so at your own risk.\nSome of our Services allow you to create a voice model that can be used to generate Output in the form of synthetic audio sounding like your voice or a voice you are authorized to share with us (a \"\n \n\"). To create a User Voice Model through our Services, you may be asked to upload audio recordings of your voice or the voice you are authorized to share with us as Input to our Services, and ElevenLabs is permitted to use those audio recordings of the voice you provide to us subject to subsection 4(d) below. For more information on how we collect, use, share, retain, and destroy your audio recordings, please see the Voice Processing Notice in our Privacy Policy. You may request deletion of your User Voice Models created with your Input recordings through your account.\n \n(i) Except as expressly set forth herein, as between you and ElevenLabs, you retain all rights in and to your Input.\n(ii) For the avoidance of doubt, Output may be generated by, but does not include, ElevenLabs’ foundational and other artificial intelligence voice models (the “\n”) or ElevenLabs’ foundational and other artificial intelligence or language learning models (“\n \n”) (ElevenLabs Voice Models and ElevenLabs LLMs, collectively, the “\n \n”). Except as expressly set forth herein, as between you and ElevenLabs, you retain all rights in and to your Output.\nYou hereby grant to ElevenLabs a license to use, reproduce, modify, adapt, publish, translate, create derivative works from, distribute, publicly or otherwise perform and display, and use your Input to provide the Services (including the trust and safety features therein), to improve the Services, and to develop new services and products. For avoidance of doubt, to the extent that your Input includes your voice, the foregoing license allows ElevenLabs to reproduce, modify, publish, create derivative works from, distribute, publicly or otherwise perform, and use your voice, and other indicia of your persona that may be contained therein, to provide and improve the Services, and to develop new services and products. Notwithstanding the foregoing, we will not commercialize your voice on a standalone basis without your permission to do so. Such license shall be:\n To the extent you own or acquire any intellectual property rights in or to any User Voice Models, you hereby grant to ElevenLabs a license to use, reproduce, modify, adapt, publish, translate, create derivative works from, distribute, publicly or otherwise perform and display, and use the User Voice Models to provide the Services (including the trust and safety features therein) to you, to improve the Services, and to develop new services and products. Such license shall be:\nYou may not provide Input or create Output for which you do not have all the rights necessary to grant us the license described above. You represent and warrant that the Content and User Voice Models, and our use of the Content and User Voice Models, will not violate any rights of any person or entity, or cause injury to any person or entity.\n You may not provide any Input that includes protected health information as defined by the Health Insurance Portability and Accountability Act (HIPAA) of 1996, Pub. L. No. 104-191 except as permitted by an executed HIPAA BAA.\nYou may request for us to delete your personal data as required under applicable law. Please see our \n for more information. In addition, you may request to opt out of your Content and User Voice Models being used by us to improve the Services (including the ElevenLabs Models), by completing \n. Your Content and User Voice Models will no longer be used to improve our Services (including the ElevenLabs Models) once the request has been processed by our team, but does not affect any uses of (or materials resulting from uses of) your Content or User Voice Models prior to that date.\nWe do not undertake to review all Content, and we expressly disclaim any duty or obligation to undertake any monitoring or review of any Content. Although we have no obligation to screen, edit, or monitor Content, we may:\n(i) delete or remove Content or refuse to post any Content at any time and for any reason with or without notice, including for any violations of applicable law or these Terms;\n(ii) terminate or suspend your access to all or part of the Services, temporarily or permanently, if the Content is reasonably likely, in our sole determination, to violate applicable law or these Terms;\n(iii) take any action with respect to the Content that is necessary or appropriate, in ElevenLabs’ sole discretion, to ensure compliance with applicable law and these Terms, or to protect Company’s rights, or to protect any third-party rights, including third-party intellectual property and privacy rights (e.g., providing information to copyright owners in furtherance of Digital Millennium Copyright Act takedown requests) or to respond to threats to the personal safety of users or the public; and\n(iv) as permitted by law, cooperate fully with any law enforcement authorities or court order requesting or directing us to disclose the identity or other information of anyone posting any Content on or through the Services.\nThe Services, including the text, graphics, images, photographs, videos, illustrations, and other content contained therein, and all intellectual property rights therein and thereto, are owned by ElevenLabs or our licensors. Except as explicitly stated in these Terms, all rights in and to the Services, including all intellectual property rights therein and thereto, are reserved by us or our licensors.\nSubject to your compliance with these Terms, ElevenLabs hereby grants to you a limited, non-exclusive, non-transferable, non-sublicensable, revocable license to access and use our Services. For clarity, any use of the Services other than as specifically authorized herein, without our prior written permission, is strictly prohibited and will terminate the license granted herein.\n The name “ElevenLabs” and our logos, product or service names, slogans, and the look and feel of the Services are trademarks of ElevenLabs and may not be copied, imitated or used, in whole or in part, without our prior written permission. All other trademarks, registered trademarks, product names, and company names or logos mentioned or in connection with the Services are the property of their respective owners. Reference to any products, services, processes, or other information by trade name, trademark, manufacturer, supplier, or otherwise does not constitute or imply endorsement, sponsorship, or recommendation by us.\nYou may voluntarily post, submit, or otherwise communicate to us any questions, comments, suggestions, ideas, original or creative materials, or other information about ElevenLabs or our Services (collectively, “\n”). You understand that we may use such Feedback for any purpose, commercial or otherwise, without acknowledgement or compensation to you, including to develop, copy, publish, or improve the Feedback or Services, or to improve or develop new products, services, or technologies in ElevenLabs’ sole discretion. ElevenLabs will exclusively own any improvements to, or new inventions based upon, such Services, or Services based on the Feedback. You understand that ElevenLabs may treat any Feedback as nonconfidential.\n To access and use certain Services, you may be required to enroll in a subscription payment plan (a “\n”). Your Recurring Subscription will automatically renew until you cancel it or your Recurring Subscription is otherwise terminated. You authorize us to store your payment method information and to automatically charge your payment method(s) for the amount of your Recurring Subscription with no further action required by you. The length of your Recurring Subscription will be provided when you make your purchase. In the event that ElevenLabs is unable to charge your payment method(s) as authorized by you when you enrolled in a Recurring Subscription, ElevenLabs may in its sole discretion (i) suspend your access to the Services until payment is received or (ii) seek to update your payment method information through third-party sources (i.e., your bank or a payment processor) to continue charging your payment method as authorized by you. You may cancel your subscription through your account. You may cancel a Recurring Subscription at any time, but if you cancel your Recurring Subscription before the end of the current subscription period, we will not refund any subscription fees already paid to us. Following any cancellation, however, you will continue to have access to the applicable Services through the end of your current subscription period. ElevenLabs may change the prices charged for Recurring Subscriptions at any time by posting updated pricing through the Services; provided, however, that the prices for your Recurring Subscription will remain in force for the duration of the subscription period for which you have paid. After that period ends, your use of the applicable Services will be charged at the then-current subscription price. If you do not agree to these price changes, you must cancel your Recurring Subscription at least 7 days before the changes take effect. If you do not cancel, your Recurring Subscription will automatically renew at the then-current price at the time of renewal and for the same duration as the initial subscription term, and ElevenLabs will charge your on-file payment card or method on the first day of the renewal of the subscription term.\n In the event your usage exceeds the volume provided under your Recurring Subscription, you will be charged usage overage fees for your Recurring Subscription, as indicated to you upon subscribing. In such event, you hereby authorize us to charge your payment method on file or any other payment method you choose for these charges.\nYou represent and warrant that you have the right to use any payment method that you submit in connection with a payment. We may receive updated information from your issuing bank or our payment service provider about any payment method you have stored with us. You authorize us to charge your payment method, including any updated payment method information we receive, for any charges you are responsible for under these Terms. Verification of information may be required prior to the acknowledgment or completion of any transaction. You will pay all charges incurred by you or on your behalf through the Services, at the prices in effect when such charges are incurred, including all taxes and shipping and handling charges applicable to your transactions. In the event legal action is necessary to collect on balances due, you will reimburse us and our vendors or agents for all expenses incurred to recover sums due, including attorneys’ fees and other legal expenses.\n All sales are final. We may offer refunds at our sole discretion.\nElevenLabs reserves the right, including without prior notice to impose conditions on the honoring of any coupon, discount, or similar promotion; to bar any user from making any transaction; to alter the payment option for services; and to refuse to provide any user with any Service.\n In accordance with the Digital Millennium Copyright Act (“\n”) and other applicable law, we have adopted a policy of terminating, in appropriate circumstances, the accounts of users who infringe the intellectual property rights of others (our \"\n\").\nIf you believe that any content on our Services infringe any copyright that you own or control, you may notify ElevenLabs’ designated agent (your notification, a “\n”) as follows:\nBy Certified Mail:\nBy Email: \nPlease see Section 512(c)(3) of the DMCA for the requirements of a proper notification. If you fail to comply with all of the requirements of Section 512(c)(3) of the DMCA, your notice may not be effective. If you knowingly materially misrepresent that any activity or material on our Services is infringing, you may be liable to ElevenLabs for certain costs and damages.\n Our Services rely on or interoperate with third-party products and services, including data storage services, communications technologies, third-party LLM providers, and internet and mobile operators (collectively, \"\n\"). These Third-Party Services are beyond our control, but their operation may impact, or be impacted by, the use and reliability of our Services.\n We may further provide information about or links to third-party products, services, activities, or events, or we may allow third parties to make their content and information available on or through the Services (collectively, \"\n\"). Your dealings or correspondence with third parties and your use of or interaction with any Third-Party Content are solely between you and the third party.\n We have no obligation to monitor Third-Party Services or Third-Party Content, and we may block or disable access to any Third-Party Services or Third-Party Content (in whole or part) through our Services at any time. Your access to and use of such Third-Party Content or Third-Party Services may be subject to additional terms, conditions, and policies applicable to such Third-Party Content (including terms of service or privacy policies of the providers of such Third-Party Services). You are responsible for obtaining and maintaining any computer hardware, equipment, network services and connectivity, telecommunications services, and other products and services necessary to access and use the Services.\nTo the fullest extent permitted by applicable law, you will indemnify, defend (at our option), and hold harmless ElevenLabs and our officers, directors, partners, licensors, employees and agents from and against any losses, liabilities, claims, demands, damages, expenses or costs (\"\n\") arising out of or related to: (a) your access to or use of the Services; (b) the Content or Feedback; (c) your violation of these Terms; (d) your violation, misappropriation, or infringement of any rights of another (including intellectual property rights or privacy rights); or (e) your conduct in connection with the Services or the Content. You will cooperate with ElevenLabs in defending such Claims, and pay all fees, costs, and expenses associated with defending such Claims (including attorneys' fees). ElevenLabs will have control of the defense or settlement, at ElevenLabs' sole option, of any third-party Claims. This indemnity is in addition to, and not in lieu of, any other indemnities set forth in a written agreement between you and ElevenLabs.\nYour use of our Services, Beta Services and any content or materials provided therein or therewith (including the Third-Party Content and Third-Party Services) is at your sole risk. To the fullest extent permitted under applicable law, our Services, Beta Services and any content or materials provided therein or therewith (including the Third-Party Content and Third-Party Services) are provided “as is” and “as available” without warranties of any kind, either express or implied. ElevenLabs disclaims all warranties with respect to the foregoing, including implied warranties of merchantability, fitness for a particular purpose, title, and non-infringement. In addition, ElevenLabs does not represent or warrant that our Services, Beta Services or any content provided therein or therewith (including the Third-Party Content and Third-Party Services) are accurate, complete, reliable, current, or error-free or that access to our Services, Beta Services or any content provided therein or therewith (including the Third-Party Content and Third-Party Services) will be uninterrupted. While ElevenLabs attempts to make your use of our Services, Beta Services and any content provided therein or therewith (including the Third-Party Content and Third-Party Services) safe, we cannot and do not represent or warrant that our Services, Beta Services or any content provided therein or therewith (including the Third-Party Content and Third-Party Services) are free of viruses or other harmful components or content or materials. All disclaimers of any kind (including in this Section 10 and elsewhere in these Terms) are made for the benefit of all ElevenLabs and ElevenLabs’ respective shareholders, agents, representatives, licensors, suppliers, and service providers, as well as our and their respective successors and assigns. Due to the nature of machine learning, the Output generated by you using the Services may not be unique across users, as the Services may produce the same or similar Output for you and a third party. Two different parties may receive the same or similar Output after submitting their respective Inputs. Responses requested by and generated for other users that are not you shall not be considered Output for you, and you shall have no right or title over it.\n To the fullest extent permitted by applicable law, ElevenLabs will not be liable to you under any theory of liability (whether based in contract, tort, negligence, warranty, or otherwise) for any indirect, consequential, exemplary, incidental, punitive, or special damages or lost profits, even if ElevenLabs has been advised of the possibility of such damages.\n The total liability of ElevenLabs for any claim arising out of or relating to these Terms or our Services, regardless of the form of the action, is limited to the greater of: (i) One Hundred United States Dollars ($100 USD); and (ii) the amount paid by you to use our Services in the 12 months preceding the claim.\nPlease read this Section 12 carefully because it requires you and ElevenLabs to arbitrate certain disputes and claims and limits the manner in which we can seek relief from each other. Arbitration precludes you and ElevenLabs from suing in court or having a jury trial. You and ElevenLabs agree that arbitration will be solely on an individual basis and not as a class arbitration, class action, or any other kind of representative proceeding. ElevenLabs and you are each waiving the right to trial by a jury.Follow the instructions below if you wish to opt out of the requirement of arbitration on an individual basis. No class or representative actions or arbitrations are allowed under this arbitration agreement.\n For any dispute or claim between you and ElevenLabs arising out of or relating in any way to your access to or use of the Services, any communications you receive, any products sold or distributed through the Services or these Terms and prior versions of these Terms, including claims and disputes that arose between you and us before the effective date of these Terms, or any privacy or data security claims, (collectively, “\n”, and each a “\n”), you and ElevenLabs agree to attempt to first resolve the Claim informally via the following process:\nExcept for individual disputes that qualify for small claims court and any disputes exclusively related to the intellectual property or intellectual property rights of you or ElevenLabs, including any disputes in which you or ElevenLabs seek injunctive or other equitable relief for the alleged unlawful use of your or ElevenLabs’ intellectual property or other infringement of your or ElevenLabs’ intellectual property rights (“\n”), all Disputes, whether based in contract, tort, statute, fraud, misrepresentation, or any other legal theory, that are not resolved in accordance with Section 12(a) will be resolved by a neutral arbitrator through final and binding arbitration instead of in a court by a judge or jury. The arbitration shall be administered by Judicial Arbitration and Mediation Services, Inc. (“\n”) pursuant to its Comprehensive Arbitration Rules and Procedures. The arbitrator will have the authority to grant any remedy or relief that would otherwise be available in court. The remedies and reliefs rendered by the arbitrator may be confirmed and enforced in any court having jurisdiction.\nA party who wishes to initiate arbitration must provide the other party with a request for arbitration (the “\n”). The Request must include: (i) the name, mailing address, email address, and telephone number of the party seeking arbitration and the email address associated with any applicable account; (ii) a statement of the legal claims being asserted and the factual bases of those claims; (iii) a description of the remedy sought and an accurate, good faith calculation of the amount in controversy in United States dollars; (iv) a statement certifying completion of the informal dispute resolution process as described in Section 12(a) above; and (v) evidence that the requesting party has paid any necessary filing fees in connection with such arbitration.\nIf the party requesting arbitration is represented by counsel, the Request shall also include such counsel’s name, mailing address, email address, and telephone number. Such counsel must also sign the Request. By signing the Request, counsel certifies to the best of counsel’s knowledge, information, and belief, formed after an inquiry reasonable under the circumstances, that: (A) the Request is not being presented for an improper purpose, such as to harass, cause unnecessary delay, or needlessly increase the cost of dispute resolution; (B) the claims, defenses and other legal contentions are warranted by existing law or by a non-frivolous argument for extending, modifying, or reversing existing law or for establishing new law; and (C) the factual and damages contentions have evidentiary support or, if specifically so identified, will likely have evidentiary support after a reasonable opportunity for further investigation or discovery. \nYou and ElevenLabs agree that all materials and documents exchanged during the arbitration proceedings shall be kept confidential and shall not be shared with anyone except the parties’ attorneys, accountants, or authorized representatives, and shall be subject to the condition that they agree to keep all materials and documents exchanged during the arbitration proceedings strictly confidential. \n You have the right to opt out of binding arbitration within 30 days of the date you first accepted these Terms by providing us with notice of your decision to opt-out via email or by certified mail to the applicable address set out below. In order to be effective, the opt-out notice must include your full name, mailing address, and email address. The notice must also clearly indicate your intent to opt out of binding arbitration. By opting out of binding arbitration, you are agreeing to resolve disputes in accordance with Section 12.\nYou may reject any change we make to Section 12 (except address changes) by personally signing and sending us notice within 30 days of the change by certified mail addressed to: \nIf you do, the most recent version of Section 12 before the change you rejected will apply.\n If any portion of this Section 12 is found to be unenforceable or unlawful for any reason, including but not limited to because it is found to be unconscionable, (i) the unenforceable or unlawful provision will be severed from these Terms; (ii) severance of the unenforceable or unlawful provision will have no impact whatsoever on the remainder of this Section 12 or the parties’ ability to compel arbitration of any remaining claims on an individual basis pursuant to this Section 12; and (iii) to the extent that any claims must therefore proceed on a class, collective, consolidated, or representative basis, such claims must be litigated in a civil court of competent jurisdiction and not in arbitration. The litigation of those claims will be stayed pending the outcome of any individual claims in arbitration. Further, if any part of this Section 12 is found to prohibit an individual claim seeking public injunctive relief, that provision will have no effect to the extent such relief is allowed to be sought out of arbitration, and the remainder of this Section 12 will be enforceable.\n YOU AND ELEVENLABS HEREBY WAIVE ANY CONSTITUTIONAL AND STATUTORY RIGHTS TO SUE IN COURT AND HAVE A TRIAL IN FRONT OF A JUDGE OR A JURY. You and ElevenLabs are instead electing that all Disputes shall be resolved by arbitration under these Terms, except as specified in Section 12(b). \nYOU AND ELEVENLABS AGREE THAT, EXCEPT AS SPECIFIED IN SECTION 12(h), EACH PARTY MAY BRING CLAIMS AGAINST THE OTHER ONLY ON AN INDIVIDUAL BASIS AND NOT ON A CLASS, REPRESENTATIVE, OR COLLECTIVE BASIS, AND THE PARTIES HEREBY WAIVE ALL RIGHTS TO HAVE ANY DISPUTE BE BROUGHT, HEARD, ADMINISTERED, RESOLVED, OR ARBITRATED ON A CLASS, COLLECTIVE, REPRESENTATIVE, OR MASS ACTION BASIS. ONLY INDIVIDUAL RELIEF IS AVAILABLE, AND DISPUTES OF MORE THAN ONE CUSTOMER OR USER CANNOT BE ARBITRATED OR CONSOLIDATED WITH THOSE OF ANY OTHER CUSTOMER OR USER. Subject to this Section 12, the arbitrator may award declaratory or injunctive relief only in favor of the individual party seeking relief and only to the extent necessary to provide relief warranted by the party’s individual claim. Nothing in this paragraph is intended to, nor shall it, affect the terms and conditions under Section 12(h). Notwithstanding anything to the contrary in this Section 12, if a court decides by means of a final decision, not subject to any further appeal or recourse, that the limitations of this Section are invalid or unenforceable as to a particular claim or request for relief, you and ElevenLabs agree that the particular claim or request for relief, and only that particular claim or request for relief, shall be severed from the arbitration and may be litigated in the state or federal courts located in the State of New York. All other Disputes shall be arbitrated or litigated in small claims court. This Section does not prevent you or ElevenLabs from participating in a class-wide settlement of claims.\nTo increase the efficiency of administration and resolution of arbitrations, you and ElevenLabs agree that in the event that there are 100 or more individual Requests of a substantially similar nature filed against ElevenLabs by or with the assistance of the same law firm, group of law firms, or organizations, within a 30 day period (or as soon as possible thereafter), JAMS shall: (i) administer the arbitration demands in batches of 100 Requests per batch (plus, to the extent there are less than 100 Requests left over after the batching described above, a final batch consisting of the remaining Requests); (ii) appoint one arbitrator for each batch; and (iii) provide for the resolution of each batch as a single consolidated arbitration with one set of filing and administrative fees due per side per batch, one procedural calendar, one hearing (if any) in a place to be determined by the arbitrator, and one final award (“\n”).\nAll parties agree that Requests are of a “substantially similar nature” if they arise out of or relate to the same event or factual scenario and raise the same or similar legal issues and seek the same or similar relief. To the extent the parties disagree on the application of the Batch Arbitration process, the disagreeing party shall advise JAMS, and JAMS shall appoint a sole standing arbitrator to determine the applicability of the Batch Arbitration process (“\n”). In an effort to expedite resolution of any such dispute by the Administrative Arbitrator, the parties agree the Administrative Arbitrator may set forth such procedures as are necessary to resolve any disputes promptly. The Administrative Arbitrator’s fees shall be paid by ElevenLabs. \nYou and ElevenLabs agree to cooperate in good faith with JAMS to implement the Batch Arbitration process, including the payment of single filing and administrative fees for batches of Requests, as well as any steps to minimize the time and costs of arbitration, which may include: (1) the appointment of a discovery special master to assist the arbitrator in the resolution of discovery disputes; and (2) the adoption of an expedited calendar of the arbitration proceedings. \n   \nAny Claims will be governed by and construed and enforced in accordance with the laws of the State of New York, except to the extent preempted by U.S. Federal Law, without regard to conflict of law rules or principles (whether of the State of New York or any other jurisdiction) that would cause the application of the laws of any other jurisdiction. If any Claim is not subject to arbitration pursuant to Section 12, then the state and federal courts located in New York City, New York, will have exclusive jurisdiction. You and ElevenLabs waive any objection to venue in any such courts. If your local law requires that consumer contracts be interpreted subject to local law and enforced in the courts of that jurisdiction, this section may not apply to you only to the extent that local law conflicts with this section.\nWe may: (a) modify, impose limits on, replace, upgrade, update, suspend, or terminate providing all or part of our Services at any time; (b) charge, modify, or waive any fees required to use the Services; or (c) offer opportunities to some or all end users of the Services, each of (a) through (c) without any liability or additional notice to you. All modifications and additions to the Services will be governed by the Terms or Supplemental Terms, unless otherwise expressly stated by ElevenLabs in writing. We are not responsible for any loss or harm related to your inability to access or use our Services.\nYou are responsible for compliance with United States export controls and for any violation of such controls, including any United States embargoes or other federal rules and regulations restricting exports. You represent and warrant that you are not located in a country or territory that is subject to economic sanctions or trade embargoes imposed by the U.S. Government (including Belarus, Cuba, Iran, North Korea, Russia, Syria, and the annexed regions of Ukraine), that you are not listed on identified on any U.S. Government list of sanctioned individuals, that you will comply fully with all relevant export laws and regulations of the United States and other international trade laws applicable to your use of the Services.\nElevenLabs’ failure to exercise or enforce any right or provision of these Terms will not operate as a waiver of such right or provision. These Terms reflect the entire agreement between the parties relating to the subject matter hereof and supersede all prior agreements, representations, statements, and understandings of the parties. Except as otherwise provided herein, these Terms are intended solely for the benefit of the parties and are not intended to confer third-party beneficiary rights upon any other person or entity. Communications and transactions between us may be conducted electronically.\nThe section titles in these Terms are for convenience only and have no legal or contractual effect. Lists of examples following “including” or “e.g.” or similar words are not exhaustive (that is, they are interpreted to include “without limitation”). All monetary amounts are expressed in U.S. dollars. URLs are understood to also refer to successor URLs, URLs for localized content, and information or resources linked from within the websites at the specified URLs. The word “or” will be deemed an inclusive “or”.\nIf any portion of these Terms is found to be unenforceable or unlawful for any reason, including but not limited to because it is found to be unconscionable, (a) the unenforceable or unlawful provision will be severed from these Terms; (b) severance of the unenforceable or unlawful provision will have no impact whatsoever on the remainder of these Terms; and (c) the unenforceable or unlawful provision may be revised to the extent required to render the Terms enforceable or valid, and the rights and responsibilities of the parties will be interpreted and enforced accordingly, so as to preserve the Terms and the intent of the Terms to the fullest possible extent.\n If you have a question or complaint regarding the Services, please send an email to \n. You may also contact us by writing to:\nnote that email communications will not necessarily be secure; accordingly, you should not include payment card information or other sensitive information in your email correspondence with us. Further, under California Civil Code Section 1789.3, California consumers are entitled to the following specific consumer rights notice: The Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs may be contacted in writing at 1625 North Market Boulevard, Suite N-112, Sacramento, California 95834, or by telephone at 1 (800) 952-5210.\nIf you download our mobile application associated with the Services (“\n”) from an app store or distribution platform (each, an “\n”), you acknowledge and agree that the availability of the Mobile App and the Services is dependent on the App Store from whom you received the Mobile App license, and that these Terms are between you and ElevenLabs and not with the App Store. ElevenLabs, not the App Store, is solely responsible for the Services, including the Mobile App.  In order to use the Mobile App, you must have access to a wireless network, and you agree to pay all fees associated with such access.  You also agree to pay all fees (if any) charged by the App Store in connection with the Services, including the Mobile App.  You agree to comply with, and your license to use the Mobile App is conditioned upon your compliance with all terms of agreement imposed by the applicable App Store when using any Service, including the Mobile App. You acknowledge that the App Store (and its subsidiaries) are third-party beneficiaries of the Agreement and will have the right to enforce it.\nThe following terms apply if you download our Mobile App from a device made by Apple Inc. (“\n”) or the Apple App Store.\n(i)\n You acknowledge that these Terms are concluded solely between us, and not with Apple. ElevenLabs, not Apple, is solely responsible for the Mobile App and the content thereof. You further acknowledge that the usage rules for the Mobile App are subject to any additional restrictions set forth in the Usage Rules for the Apple App Store Terms of Service as of the date you download the Mobile App, and in the event of any conflict, the Usage Rules in the Apple App Store will govern if they are more restrictive. You acknowledge that you have had the opportunity to review the Usage Rules.\n(ii)\n The license granted to you is limited to a non-transferable license to use the Mobile App on any iPhone, iPod touch, iPad, or any other Apple device that you own or control as permitted by the Usage Rules set forth in the Apple App Store Terms of Service.\n(iii)\nYou and ElevenLabs acknowledge that Apple has no obligation whatsoever to furnish any maintenance and support services with respect to the Mobile App.\n(iv) \nYou acknowledge that Apple is not responsible for any product warranties, whether express or implied by law, with respect to the Mobile App. In the event of any failure of the Mobile App to conform to any applicable warranty, you may notify Apple, and Apple will refund the purchase price, if any, paid to Apple for the Mobile App by you; and to the maximum extent permitted by applicable law, Apple will have no other warranty obligation whatsoever with respect to the Mobile App. The parties acknowledge that to the extent that there are any applicable warranties, any other claims, losses, liabilities, damages, costs, or expenses attributable to any failure to conform to any such applicable warranty would be the sole responsibility of ElevenLabs. However, ElevenLabs has disclaimed all warranties of any kind with respect to the Mobile App, and therefore, there are no warranties applicable to the Mobile App.\n(v)\nYou and ElevenLabs acknowledge that as between Apple and ElevenLabs, ElevenLabs, not Apple, is responsible for addressing any claims relating to the Mobile App or your possession and/or use of the Mobile App, including, but not limited to (A) product liability claims, (B) any claim that the Mobile App fails to conform to any applicable legal or regulatory requirement, and (C) claims arising under consumer protection or similar legislation.\n(vi) \nThe parties acknowledge that, in the event of any third-party claim that the Mobile App or your possession and use of the Mobile App infringe that third party’s intellectual property rights, ElevenLabs, and not Apple, will be solely responsible for the investigation, defense, settlement and discharge of any such intellectual property infringement claim to the extent required under these Terms.\n(vii)\n Apple and its subsidiaries are third-party beneficiaries of these Terms, and upon your acceptance of these Terms, Apple will have the right (and will be deemed to have accepted the right) to enforce these Terms against you as a third-party beneficiary thereof.\n The following terms apply if you download our Mobile App from Google Play (or its successors) operated by Google, Inc. or one of its affiliates (“\n”).\n(i) \nYou acknowledge that to the extent of any conflict between (A) the Google Play Terms of Services and the Google Play Business and Program Policies or such other terms which Google designates as default end user license terms for Google Play (all of which together are referred to as the “\n”), and (B) the other terms and conditions in these Terms, the Google Play Terms shall apply with respect to your use of the Mobile App that you download from Google Play.\n(ii) \nYou acknowledge that Google does not have any responsibility or liability related to compliance or noncompliance by ElevenLabs or you (or any other user) under these Terms or the Google Play Terms.\nCreate with the highest quality AI Audio\nResearch\nProducts\nSolutions\nEarn As\nResources\nCompany\nReach everyone with AI audio\n© 2025 ElevenLabs"
}
,
{
    "url": "https://github.com/genecyber/TDD-BlackJack",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nLicense\ngenecyber/TDD-BlackJack\nFolders and files\nLatest commit\nHistory\nRepository files navigation\nAbout\nLicense\nStars\nWatchers\nForks\n\n  \n\n  \nLanguages\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n        Test Driven BlackJack Game Written in .NET\n      \n\n        Test Driven BlackJack Game Written in .NET"
}
,
{
    "url": "https://elevenlabs.io/iconic-voices",
    "text": "Iconic Voices\nLegendary voices, unforgettable listening\nExperience our select Iconic Voices\nExperience the unforgettable magic of iconic voices with AI narration\nFeatured icons\nDr. Maya Angelou™\nBurt Reynolds™\nSir Laurence Olivier™ \nJerry Garcia™\nJudy Garland™\nJohn Wayne™\nDeepak Chopra™\nJames Dean™\nDr. Richard Feynman™\nCid Moreira™\n \nElevenLabs to Lend His Voice to Its Reader App\n \nis now available globally\n \nJames Dean, Burt Reynolds & Laurence Olivier\nTry the free iOS app\nTry the free Android app\nFooter\nIconic Voices\nElevenLabs is proud to collaborate with some of the world’s most iconic voices, securing exclusive licenses to create unique and immersive reading experiences.\nElevenLabs is synonymous with quality, and that's why we're bringing together industry icons to make your reading journey even more enjoyable. \nLegendary voices from television, film, literature, and beyond are being made exclusively available through the ElevenReader App, ready to narrate your favorite masterpieces.\nDr. Maya Angelou was a renowned poet, author, activist, and civil rights leader.\nBurt Reynolds was a popular American actor known for his roles in action films and comedies.\nSir Laurence Olivier was a renowned British actor and director, celebrated for his Shakespearean performances.\nJerry Garcia was the lead guitarist, singer, and co-founder of the rock band Grateful Dead.\nJudy Garland was a legendary American actress and singer, best known for The Wizard of Oz.\nJohn Wayne was an iconic American actor, famous for his roles in Western films. \nDeepak Chopra is a prominent author and speaker, known for his work on alternative medicine and spirituality.\nJames Dean was an iconic American actor, known for his portrayals of rebellious characters.\nRichard Feynman was a Nobel Prize-winning American physicist, celebrated for his insightful teaching style. \nCid Moreira was a journalist whose unmistakable baritone made him a defining presence in Brazilian media.\niOS App Store\nGoogle Play Store\nCreate with the highest quality AI Audio\nResearch\nProducts\nSolutions\nEarn As\nResources\nCompany\nReach everyone with AI audio\n© 2025 ElevenLabs"
}
,
{
    "url": "https://github.com/Harry-Lees/pre-commit-pin-dependencies",
    "text": "Navigation Menu\nSearch code, repositories, users, issues, pull requests...\n\n        Provide feedback\n      \n\n        Saved searches\n      \nUse saved searches to filter your results more quickly\nLicense\nHarry-Lees/pre-commit-pin-dependencies\nFolders and files\nLatest commit\nHistory\nRepository files navigation\npre-commit pin Poetry dependencies\nInstallation\nExample\nMotivation\nAbout\nTopics\nResources\nLicense\nStars\nWatchers\nForks\n\n  \n\n  \nLanguages\nFooter\nFooter navigation\nWe read every piece of feedback, and take your input very seriously.\n\n            To see all available qualifiers, see our \n.\n          \n\n        A pre-commit hook to check if poetry dependencies are pinned\n      \nA pre-commit hook to ensure Poetry dependencies are pinned.\nThe following pyproject.toml will raise an error as the Python dependency is not pinned.\nWhen writing application code, it is important to ensure dependencies are pinned\nin order to ensure reproducable builds.\nBy default, poetry will use \n which will allow a range of possible versions. This can be misleading and cause hard to spot bugs in CI.\n\n        A pre-commit hook to check if poetry dependencies are pinned"
}
,
{
    "url": "https://elevenlabs.io/privacy-policy",
    "text": "Privacy Policy\nFooter\nUpdated 23 November 2024\nThis Privacy Policy (\"\n\") explains how Eleven Labs Inc. and our affiliates (\"\n\", \"\n\", or \"\n\") process Personal Data of individuals who use our services, including our platform, websites (e.g., elevenlabs.io), mobile applications, and other online services (jointly, the \"\n\"). This Policy also explains your rights and choices about how we use your Personal Data, including how you can access or update certain information about you.\nIn this Policy, \"Personal Data\" means any information relating to an identified or identifiable individual, such as an individual's name, address, telephone number, or email address. In certain jurisdictions, this may also be referred to as “Personal Information” \nThis Policy does not apply when we offer our Services and process Personal Data on behalf of enterprise/business customers. We act as a service provider/processor for those relationships and our use of that data is governed by our customer agreements.\n \nIn some cases, we need to collect your Personal Data to provide you with our Services. In these cases, if you choose not to provide the requested Personal Data, you may not be able to use our Services. We will tell you if providing Personal Data is required by law or under a contract and what are the consequences of failing to provide it.    \n \nDepending on the country in which you are located, we will only process your Personal Data based on a valid legal ground. The table below describes the purposes for which we process your Personal Data and the legal grounds. Depending on where you are located, when we rely on legitimate interest as the legal grounds to process your Personal Data, you have the right to object to that processing using the online form set out in Section 7 (“\n”).\nWe only rely on our or a third party's legitimate interests to process your Personal Data when we determine that these interests are not overridden by your rights and interests. When we are using your information because we or a third party have a legitimate interest to do so, you may have the right to object to that use.\n \nElevenLabs uses Voice Data to provide its voice services, including voice modeling, speech-to-speech, and dubbing services. For voice modeling, when you provide us with recordings of your voice, we utilize our proprietary, AI-based technologies that analyze your speech characteristics to formulate a distinct voice model of your vocal traits. This voice model can be used to generate audio resembling your voice. Depending on where you reside and how we use your Voice Data (as set out in this Policy), applicable law may define your Voice Data as biometric data. We do not use Voice Data to infer characteristics about an individual.\n \n  \nElevenLabs uses Voice Data to help our models and products learn about patterns and connections in speech and audio content and to improve our Services. We do not use Voice Data, Personal Data, or publicly available data used for training to profile or target consumers.  \n \nElevenLabs does not undertake to review all Content and expressly disclaims any duty or obligation to monitor or review content. However, in order to maintain the integrity and security of your data, and for fraud prevention purposes, ElevenLabs reserves the right to moderate all voice and text data input into ElevenLabs tools and voice or other outputs. In certain circumstances, ElevenLabs may share your inputs or outputs, which may include Personal Data, with third parties to support the content moderation and safety initiatives. Users found to have engaged in activity that violates the \n may be subject to termination or suspension under the applicable Terms of Service. \nYour Personal Data may be shared with:\nOur Services are hosted in the United States, the Netherlands and Singapore. If you choose to use our Services, your Personal Data may be processed in Singapore, the Netherlands or the United States depending on your location at that time. Regardless of user location, all Personal Data will be transferred to the United States for storage. \nIf you are located in the European Economic Area, the United Kingdom or Switzerland (\"\n\"), we may transfer your Personal Data to recipients in countries outside of Europe, including to the United States and Singapore. We apply appropriate protections when we transfer your Personal Data to such countries, including:\nIf you are located in Brazil, we may transfer your Personal Data to recipients in countries outside of Brazil, including to United States, Netherlands, and Singapore. We apply appropriate protections when we transfer your Personal Data to such countries, including:\nFor more information about how we transfer outside Europe or Brazil, or to obtain a copy of the contractual safeguards we use for such transfers, you may contact us using the contact details indicated in the \"Contact Us\" section below.\nPlease note that the data protection laws in your jurisdiction may be different from the laws applicable in the U.S., Brazil or Europe.\nWe take measures to delete your Personal Data or keep it in a form that does not permit identifying you when this information is no longer necessary for the purposes for which we process it unless we are required or permitted by law to keep this information for a longer period. When determining the specific retention period, we consider various factors, such as the type of service provided to you, the nature and length of our relationship with you, and mandatory retention periods provided by law and any relevant statute of limitations. ElevenLabs will not keep data it generates about your voice longer than 3 years after your last interaction with us, except as required by law.\nCookies, pixel tags, SDKs, or similar technologies (“\n”) are technologies used to collect information about users and their activities on a website. We and our third-party partners, such as analytics and advertising partners, may collect information about you using Cookies to collect information about your online activities over time and across different services. \nThe information collected via Cookies may include information such as unique identifiers, system information, IP address, web browser, device type, and the web pages that you visit just before or just after you use the Services, as well as information about your interactions with the Services, such as the date and time of your visit, and where you have clicked. \n. \nWe may use both session cookies and persistent cookies. A session cookie disappears after you close your browser. A persistent cookie remains after you close your browser and may be used by your browser on subsequent visits to our Services. Cookies we or our third-party partners place may fall under one of the following purposes: \nDepending on the country in which you are located, you may be asked to provide your consent for our use of Cookies (except for strictly necessary Cookies). In addition, you have the following choices concerning the use of Cookies.\n \nDepending on where you are located or reside, you may have certain rights regarding the Personal Data we maintain about you and certain choices about what Personal Data we collect from you, how we use it, and how we communicate with you.\nYou may exercise these rights by using this online \n. Please select “Other” and include the right you would like to exercise in the subject (e.g., “Withdraw my Consent”) and note the state or country in which you reside in the form. Before fulfilling your request, we may ask you to provide reasonable information to verify your identity. Please note that applicable law may provide for exceptions and limitations to each of these rights.\nIn addition to the rights listed above, you may also have the right to lodge a complaint with a supervisory authority, including in your country of residence, place of work, or where an incident took place.\nIf you are a resident of certain U.S. states with applicable privacy regulations, including California, Connecticut, Colorado, Utah, Virginia, Oregon, Montana, or Texas, there are additional disclosures and certain additional rights regarding your Personal Information, as described below. In certain U.S. states, in addition to the rights in Section 7a, you also have the following rights.  \nWhen we share Personal Information through our targeting cookies or with vendors that provide advertising services to us, that is considered a sale or sharing for cross-context behavioral advertising or targeted advertising under certain U.S. state privacy laws. You can opt out of the sale of your Personal Information, including the sharing of your Personal Information for targeted or cross-contextual behavioral advertising by submitting your request \n \nThe following types of Personal Information may be processed for purposes of targeted advertising, and may have been “shared” or “sold” in the 12 months prior to the last modified date of the privacy policy:\nEach category of Personal Information listed above may be “shared” with or “sold” to the following third parties in connection with our marketing activities:\nDue to the fact that our services are intended for users age 18 or over, we do not knowingly we “sell” or “share” Personal Information of individuals under the age of 18.\n Our websites and apps are not designed to respond to “do not track” requests from browsers.\n In those states where it is applicable, your authorized agent may submit a request to exercise any of the above rights on your behalf. ElevenLabs may request additional information to verify their authority to act on your behalf before processing any requests. \nOur Services may contain links to other websites, products, or services that we do not own or operate. We are not responsible for the privacy practices of these third parties. Please be aware that this Privacy Policy does not apply to your activities on these third-party services or any information you disclose to these third parties. We encourage you to read their privacy policies before providing any information to them.\nWe implement reasonable security measures to secure and protect your Personal Data. The up-to-date list of measures along with relevant audit certifications can be obtained at: \n. We note that, as no electronic transmission or storage of information can be entirely secure, we can make no guarantees as to the security or privacy of your information, to the extent permitted by applicable law.\nWe do not knowingly collect, maintain, or use Personal Data from children under 18 years of age, and our Services are not directed to children. You are also not allowed to upload, send, email, or otherwise make children’s Voice Data available to us or other users. The use of children’s Voice Data is prohibited on our Services. If you believe that we may have collected any such Personal Data on our Service, please notify us at \n. \nCertain ElevenLabs’ Service may involve the collection of biometric information.  We collect this information for verification purposes. We may disclose this information where necessary to our affiliates, service providers, and /or other collaborators to provide you with and develop our services. We will retain your biometric data until it is no longer needed for the purposes in which it was collected, or after 3 years of the termination of our relationship with you, whichever is sooner.\nWe may periodically update this Policy. If there are significant changes, we will notify you as required by law.\nFor any questions regarding this Policy, our processing of your Personal Data, or to exercise your rights, please contact our Data Protection Officer at \n or write us at: \nData Protection Officer\nIf you are located in the European Economic Area, the UK or Switzerland, the controller for the processing of your Voice Data is \nCreate with the highest quality AI Audio\nResearch\nProducts\nSolutions\nEarn As\nResources\nCompany\nReach everyone with AI audio\n© 2025 ElevenLabs"
}
,
{
    "url": "https://elevenlabs.io/brand",
    "text": "Brand guidelines and press kit\nLogo\nClearance\nSymbol\nWhat to avoid\nStacked\nShorthand\nFooter\nThis page provides essential guidance and assets for the correct use of ElevenLabs trademarks and copyrighted materials. It is designed for all external entities engaging with our brand. Adherence to these guidelines is crucial when incorporating ElevenLabs branding elements into third-party assets and materials, ensuring proper representation of our intellectual property.\nTo ensure visual impact our logo needs to be surrounded by ample and unobstructed space. All communications must adhere to a minimum area of clearance, which is determined by the logo's size and is equal to its height.\nThe visual shorthand for our brand is our 11 icon, constructed from two distinctively simple vertical lines. It abstracts the number eleven from our name while also subtly referencing the pause icon seen when listening to audio.\nAvoid stacking the wordmark as two separate words. Likewise, avoid altering the height of the 11 icon to match the wordmark's height.\nWe may occasionally use a shorthand in plain text, ensure that this is not reflected in any logo variants.\nDon’t apply effects like drop shadows\nDon’t apply strokes or outlines\nDon’t rotate or angle our logo\nDon’t apply color\nDon’t stretch or deform it\nDon’t recreate the logo in other fonts\nAlso avoid...\n — With a space between Eleven and Labs\n — Without a capitalised L\n — With lowercase E and L\n — In all caps\n — Using captialized I’s to recreate the 11 icon\n — Using 11 to recreate the 11 icon\nCreate with the highest quality AI Audio\nResearch\nProducts\nSolutions\nEarn As\nResources\nCompany\nReach everyone with AI audio\n© 2025 ElevenLabs"
}
,
{
    "url": "https://elevenlabs.io/impact-program",
    "text": "Impact Program\nOn a mission to help 1 million people reclaim their voice\nPartner with ElevenLabs Impact program\nFree licenses for accessibility individuals\nBreaking barriers in accessibility\nImpact stories\nLenovo launches TTS eye tracking device for ALS accessibility\nDella Larsen records her voice to create memories for her family\nBill Weihl continues to fight for climate policy progress while battling ALS\nLori Cohen's AI-enabled return to law\nReclaiming a voice: how AI helped a CEO speak again\nMaking recovery resources accessible in 9 languages with AI audio\nAI Audio in Taiwan’s Parliament\nLaughing through it all: a comedy special like no other\nFrequently asked questions\nFooter\nImpact Program\nAt ElevenLabs, we drive social good through AI audio. Our Impact Program partners with nonprofits to provide free licenses for projects in accessibility, education, and culture. We aim to enable 1 million voices to communicate and learn without barriers. If your nonprofit could benefit from AI audio, we’d love to hear from you. Let’s create a world where every voice makes a difference.\nIn August 2024, ElevenLabs launched an initiative to support those struggling with aphasia by providing free licenses to ALS (Amyotrophic Lateral Sclerosis) and MND (Motor Neuron Disease) patients. We are proud to now extend this offering to individuals with MSA (Multiple System Atrophy) and mouth cancer. We are excited to continue expanding eligibility as we work toward our goal of reaching one million people.\nWhen U.S. Congresswoman Jennifer Wexton began losing her voice due to Progressive supranuclear palsy (PSP), it seemed like the end of her ability to communicate in her own words. The standard robotic voice wasn’t just limiting—it felt like a loss of identity. But with ElevenLabs' technology, everything changed. \n \nBy recreating her voice as it sounded before her diagnosis, Congresswoman Wexton became the first lawmaker to deliver a House floor speech powered by AI, proving that even at the top of their field, people can overcome incredible challenges with the right tools.\nA collaboration between Lenovo, the Scott-Morgan Foundation, and us brings new communication tools to people with ALS\nKeeping family connections alive across generations\n\nHear the inspiring speech he delivered at GreenBiz 24 with ElevenLabs\nA Story of Resilience and Technological Breakthrough in the Legal Field\nAI technology restores Ben Baldanza’s communication abilities post-ALS diagnosis\n\nHelping DFV survivors access support in their own language\nDr. Chen Ching-Hui’s AI assisted questioning session with the Premier\nHumor and hope in the face of ALS\n\nCreate with the highest quality AI Audio\nResearch\nProducts\nSolutions\nEarn As\nResources\nCompany\nReach everyone with AI audio\n© 2025 ElevenLabs"
}
,
{
    "url": "https://status.buildwithfern.com/",
    "text": "System status\nDocs\nDocs\nSDKs\nSDKs\nCalendar\n·"
}

]